{
  "title": "Gov. Braun Proclaims Small Business Week in Indiana, Citing Economic, Community Impact of Entrepreneurs",
  "content": "Indiana celebrates Small Business Week May 5-9, awards small businesses of the year recognition to seven Hoosier companies ”“As a long-time entrepreneur and business owner, recognizing this week as Small Business Week in Indiana is a celebration I value firsthand,” said Gov. Braun. “Indiana’s entrepreneurs and small business owners work tirelessly day in and day out and have had a tremendous impact on the state’s economy as well as the neighborhoods and people around them. We are excited to recognize the commitment of not only these seven small businesses, but of all our Hoosier innovators that are setting the stage for a better future for Indiana. nding neighborhoods.”“Small Business Week in Indiana is the perfect time to honor the contributions of our countless Hoosier entrepreneurs and small businesses and to showcase our commitment to accelerating Main Street innovation and entrepreneurship,” said Secretary of Commerce David J. Adams. “The seven businesses being recognized this week exemplify the spirit and the impact of Indiana’s entrepreneurial ecosystem, providing critical services for residents and contributing to the health and vibrancy of their surrou tinue to grow as a cornerstone of pet care in the community. Latimer Animal Hospital, founded by Dr. Matthew S. Latimer, provides compassionate pet care through services like preventative care, surgery and advanced diagnostics. Beyond veterinary work, Latimer Animal Hospital partners with nonprofits to support pet owners and the local community. The company recently broke ground on a new facility, enabling it to con er and Mike Pendleton founded 51 Bridges CrossFit to help others do the same. The facility offers inclusive programs for all fitness levels, emphasizing functional movements and high-intensity workouts. 51 Bridges CrossFit in Rockville is more than a gym – it's a community inspiring health and wellness. After transforming their own lives through CrossFit, Jennif rs old while reducing energy consumption by 70% in the process. Established in 1888, WF Meyers has been a trusted name in the stone-cutting industry for over 130 years. Alex Barnes and his family specialize in custom diamond tooling to help clients maximize efficiency and precision. WF Meyers recently invested in new production technology, replacing equipment that was 25 yea inesses, visit iedc.in.gov/entrepreneurship.To learn more about the many resources available to Indiana entrepreneurs and small bus The State of Indiana’s Office of Commerce was created by Governor Mike Braun to align and accelerate the state’s economic development efforts and is led by Indiana Secretary of Commerce David J. Adams.",
  "url": "https://iedc.in.gov/events/news/details/2025/05/05/gov.-braun-proclaims-small-business-week-in-indiana-citing-economic-community-impact-of-entrepreneurs",
  "date": "2025-05-05"
}