{
  "title": "IEDC Announces Mark Cuban to Headline June Global Entrepreneurship Congress",
  "content": "INDIANAPOLIS (March 12, 2025) – The Indiana Economic Development Corporation (IEDC) and Global Entrepreneurship Network (GEN) today announced billionaire entrepreneur, philanthropist and investor Mark Cuban as the keynote speaker for the 2025 Global Entrepreneurship Congress (GEC 2025), which will be held in Indianapolis June 2-5, 2025. A graduate of Indiana University, Cuban has achieved significant success as an entrepreneur and investor. In addition to founding disruptive companies like Cost Plus Drugs, which is transforming the prescription drug market, Cuban has invested in hundreds of companies and has served as a lead investor featured on the Emmy-Award-winning show “Shark Tank” since 2011. repreneurial city each year, the GEC gathers thousands of delegates from 200 countries to share and strengthen innovative approaches to empowering entrepreneurs everywhere. Indianapolis will be the second U.S. location to host the annual convention since its inaugural event in 2009, underscoring the state’s focus on entrepreneurship.Hosted by GEN in a different rising ent matchmaking, a government ministerial and networking events. In addition to a compelling keynote from Mark Cuban and insightful talks from other global leaders, the GEC 2025 program includes informative summits, workshops and masterclasses, investor bal Startup Ecosystem Report from Startup Genome and GEN. Last year, Forbes named Indiana the second-best state in America to start a business.Indiana hosting GEC 2025 is another example of the state’s focus on cultivating a robust entrepreneurial ecosystem. Indiana was ranked as the No. 11 emerging entrepreneurial ecosystem in the U.S. per the latest Glo broader State of Indiana’s Commerce Office created by Governor Mike Braun and is charged with growing the state economy, driving economic development, and helping businesses launch, grow and locate in the state. Governed by a board of directors chaired by Governor Mike Braun, the IEDC manages many initiatives, including workforce development, innovation and entrepreneurship resources, public infrastructure assistance and talent attraction and retention. For more information about the IEDC, visit iedc.in.gov.The Indiana Economic Development Corporation (IEDC) is part of the",
  "url": "https://iedc.in.gov/events/news/details/2025/03/12/iedc-announces-mark-cuban-to-headline-june-global-entrepreneurship-congress",
  "date": "2025-03-12"
}