{
  "title": "South Bend – Elkhart Regional Partnership Receives 2024 Excellence in Economic Development Silver Award From The International Economic Development Council",
  "content": "resents this award to South Bend – Elkhart Regional Partnership, celebrating their leadership and innovation in the field of economic development.”“The South Bend – Elkhart Regional Partnership is setting the standard of excellence for economic development with its WE+YOU initiative. This award highlights Regional Partnership’s commitment to its community and demonstrates the transformative impact of economic development,” said Nathan Ohle, IEDC President and CEO, “It is with great pride that IEDC p nce: An overnight experience offered free to college students highlighting internship and full-time employment opportunities in the region, while highlighting the area’s quality of place and life. Student Immersion Experie on in the region. Through initiatives like WE+YOU, we are committed to building a vibrant, inclusive, and innovative community that fosters opportunity and growth for all.”“We are deeply honored to receive the 2024 Excellence in Economic Development Silver Award from the IEDC,” said Bethany Hartley, President and CEO of the South Bend – Elkhart Regional Partnership. “This recognition underscores the hard work and dedication of our team, partners, and the community in driving meaningful talent development and retenti onal Economic Development CouncilAbout the Internati g today!The International Economic Development Council (IEDC) is a non-profit, non-partisan membership organization serving economic developers. With more than 4,300 members, IEDC is the largest organization of its kind. Economic developers promote economic well-being and quality of life for their communities by creating, retaining, and expanding jobs that facilitate growth, enhance wealth, and provide a stable tax base. From public to private, rural to urban, and local to international, IEDC’s members engage in the full range of economic development practices. Given the breadth of economic development work, our members are employed in various settings, including local, state, provincial, and federal governments, public-private partnerships, chambers of commerce, universities, and a variety of other institutions. When IEDC succeeds, its members create high-quality jobs, develop vibrant communities, and improve the quality of life in their regions. Learn more at www.iedconline.or",
  "url": "https://southbendelkhart.org/south-bend-elkhart-regional-partnership-receives-2024-excellence-in-economic-development-silver-award-from-the-international-economic-development-council/",
  "date": "2024-10-09"
}