{
  "title": "Seven Local Businesses Honored as 2025 Crowns of Enterprise Winners",
  "content": "On Thursday, Mecklenburg County and the City of Charlotte named seven local businesses as winners of the 2025 Crowns of Enterprise Awards. The awards honor small businesses that demonstrate leadership, practice sound business strategies, strengthen the local economy and support diversity and inclusion. gencies to achieve sustainable growth and measurable impact. The firm specializes in strategic planning, business coaching, community engagement and operational support. It offers services in both English and Spanish to break barriers and to help businesses access capital, secure certifications and compete for contracts.Velez Strategies is a bilingual consulting firm that empowers small businesses, nonprofits and government a projects make a difference. Lane Architecture’s diverse portfolio includes higher education projects, community support and workplace buildings. Lane Architecture is an architectural firm that provides services from initial planning, through the design and construction process, to client occupancy. The firm is focused on the public sector, where building its contracts and helps other firms become qualified for contracts with departments of transportation. Carolina Transportation Engineers & Associates (Carolina TEA) is a multidisciplined engineering firm focused on innovation, quality and client service. The firm provides project management, design and inspection services for bridge, roadway and rail projects, which enhance the region's livability and attractiveness and create a foundation for sustained economic growth. Carolina TEA teams up with diverse businesses on available to all. Owner Jefferson Ovalle leads by example, including individuals from all backgrounds in his team and projects. Ovalle identifies and dismantles barriers in the workplace to ensure that opportunities are ised families here. The Charlotte Ledger is headed by two long-term Charlotte reporters, founder and executive editor Tony Mecia and managing editor Christina Bolling, who know and understand the region because they have lived, worked and ra ogram beneficiaries per year, on average. In 2017, after supporting Hispanic entrepreneurs for decades in Florida, Prospera expanded its successful model to Charlotte. Between 2017 and the end of 2024, Prospera grew from one local office to a statewide operation with two offices (Charlotte and Raleigh), and more than 1,000 pr transforming business strategies and operations for Fortune 100 companies. With more than 20 years of corporate experience, founder and president LaShana M. Wiggs established Savvi Consulting in 2022. Wiggs has honed her expertise in",
  "url": "https://news.mecknc.gov/seven-local-businesses-honored-2025-crowns-enterprise-winners",
  "date": "2025-05-09"
}