{
  "title": "Mesquite's Finest Recognized at The 2024 BRE Annual Awards",
  "content": "Downtown Mesquite, represented by Downtown Development Coordinator, James Johnson, was honored to present the Downtowner of the Year award to Mark and Carolyn Stoddard, accepted on their behalf by their daughter, Cassie Clayton. Their invaluable contributions through the Downtown Development Advisory Board and Design Committee have played a significant role in enhancing our community, fostering growth, and supporting local businesses and residents. its longstanding partnership with the iconic Mesquite Championship Rodeo. While honoring the rich traditions of the rodeo, Mesquite Arena has also embraced modern trends, offering a diverse array of events that attract and engage a broad audience.The Visit Mesquite Partner of the Year Award was presented to the Mesquite Arena by Kim Buttram, Director of Economic Development, in recognition of its exceptional contributions to promoting and enhancing tourism in our community. The dedicated team at Mesquite Arena has continually exceeded expectations by hosting signature events, including tive Director & Marketing Strategist and Lakeitha Bradley, Director of Operations at Big Hit Creative; Mayor Daniel Alemán Jr., City of MesquiteFrom left to right: Sharon Cook, Dallas College Eastfield Campus Administrator; Glenn Bradley, Crea ctor of Operations Hexagon Purus; Mayor Daniel Alemán Jr., City of MesquiteFrom left to right: Steven Bridges, Workforce Solutions Greater Dallas; Vickey Jackson, Business Solutions Leader; Alex Keklikian, Dire s into the impactful work the company has carried out in the City of Mesquite.Alexander Helgar, President of the Mesquite Chamber of Commerce, announced The Nehemiah Company as the recipient of the 2024 Partner of the Year award. Nipun Gadhok and Liliana Soto Atenza from The Nehemiah Company graciously accepted the award and shared insight g notable dignitaries such as Mayor Dan Alemán Jr., City Manager Cliff Keheley, and Mesquite ISD Superintendent Dr. Ángel Rivera. We express our gratitude to the Mesquite ISD Education Foundation for sponsoring the luncheon, and Dallas College Eastfield Campus for providing the venue. The 2024 BRE Annual Awards ceremony drew an amazing crowd, includin The Business Retention & Expansion Task Force is a partnership of Mesquite’s core economic development stakeholder organizations, including the City of Mesquite, Mesquite Independent School District, Dallas College, Workforce Solutions Greater Dallas, the Mesquite Chamber of Commerce, Forney Independent School District, and the University of Texas at Dallas. The task force is dedicated to empowering and supporting existing employers, employees, and entrepreneurs within the community. For additional information, the City of Mesquite Economic Development Department can be contacted at 972-216-6446.",
  "url": "https://mesquiteecodev.com/news/mesquites-finest-recognized-highlights-from-the-2024-bre-annual-awards",
  "date": "2025-01-27"
}