[
  {
    "id": "b4f3f1c8-7020-4484-8281-7409714aef0c",
    "title": "Dallas airports need more art",
    "url": "https://www.axios.com/local/dallas/2025/05/14/dfw-love-field-dallas-airport-art",
    "date": "2025-05-14",
    "content": "15 hours ago -\nCulture\nDallas airports need more art\nNaheed Rajwani-Dharsi\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nFrederick Douglass Greater Rochester International Airport has several water features in its terminal. Photo: Naheed \"Explorer\" Rajwani-Dharsi/Axios\n\nDFW Airport and Dallas Love Field need more art to keep up with airports in other cities, like Detroit and Chicago.\n\nDriving the news: DFW Airport plans to add about 12 new art pieces to Terminals C, E and F from 2026 to 2030.\n\nThe big picture: The airport's coolest art is in Terminal D, which includes a mosaic path and a 16-foot sculpture showing hundreds of hands in applause.\n\nDallas Love Field has the \"Sky\" sculpture and displays local art along the walkway between the terminal exit and baggage claim.\n\nYes, but: Both airports could use more dynamic art pieces.\n\nDetroit Metro Airport turned a tunnel into art. DFW Airport, take notes for the long walkway to the Terminal E satellite gates. Photo: Naheed \"Advice Giver\" Rajwani-Dharsi/Axios\n\nState of play: The Detroit airport has a 39-foot-wide fountain where visitors can make a wish and toss in a coin. The money collected is donated to nonprofits. The airport also has a tunnel with colorful LED lights that move with music.\n\nThe Rochester, New York, airport has a mural depicting abolitionist Frederick Douglass' life and a clay-like water feature with a quote attributed to Chief Seattle of the Suquamish and Duwamish tribes.\nBaltimore/Washington International Airport features an airplane suspended from the ceiling and a rotating art collection.\nChicago O'Hare International Airport has a massive sculpture that shows two arms reaching for each other.\n\nWhat's next DFW Airport is accepting applications through May 20 for temporary exhibitions at Terminal C.\n\nOther phases are planned for 2026 and 2028.\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "DFW Airport plans to add about 12 new art pieces to Terminals C, E and F from 2026 to 2030.",
    "scrapedAt": "2025-05-15T02:31:15.451Z",
    "relevanceReason": "Strong relevance detected by model (score: 10.46)"
  },
  {
    "id": "d9dd976f-d015-453a-8729-497fd0606724",
    "title": "Dallas Mavericks win the No. 1 pick in NBA draft lottery",
    "url": "https://www.axios.com/local/dallas/2025/05/13/dallas-mavericks-draft-nba-lottery-cooper-flagg",
    "date": "2025-05-13",
    "content": "May 12, 2025 -\nNews\nDallas Mavericks win the No. 1 pick in NBA draft lottery\nNaheed Rajwani-Dharsi\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nThe Mavs had a 1.8% chance of winning the No. 1 pick in the NBA Draft Lottery. Photo: Jacek Boczarski/Anadolu via Getty Images\n\nThe Dallas Mavericks will have the No. 1 pick in the 2025 NBA draft in June.\n\nWhy it matters: It's the first time that the Mavericks have ever won the first pick in the draft lottery.\n\nAnd the timing is uncanny: The team is still rebounding from one of the wildest trade in NBA history — sending Luka Dončić to the Lakers — and missing this year's playoffs after making it to the NBA Finals last year.\n\nFun fact: The Mavericks had a 1.8% chance of getting the first pick Monday night.\n\nState of play: If the Mavericks don't trade their pick, Dallas could end up with the top players in both men's and women's college basketball.\n\nThe Dallas Wings also had the No. 1 pick this year and selected Paige Bueckers last month.\nThe Mavs now have the chance to add Duke freshman Cooper Flagg, the 2024-25 National Player of the Year, to their roster.\n\nWhat they're saying: Even before the lottery, fans were saying Dallas should trade to get Luka back if they won the No. 1 pick.\n\n\"God please reward us for all the pain we've been through,\" a fan wrote on the team's Instagram post explaining how the lottery works.\n\nBetween the lines: Mark Cuban broke the news to team governor Patrick Dumont, who was watching one of his kids compete in a track meet, per DMN reporter Brad Townsend.\n\nCuban was screaming so much, Dumont couldn't make out the words at first.\n\nZoom in: Flagg has been the presumed No. 1 pick since last summer, when he held his own on the practice U.S. Olympic squad as a 17-year-old.\n\nAfter a stellar college season, the 6-foot-9 forward is seen by some scouts as a bona fide franchise player, while others see him as an elite second star, per ESPN.\n\nWhat's next: The first round of the draft takes place June 25.\n\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "The Mavs now have the chance to add Duke star Cooper Flagg to their roster.",
    "scrapedAt": "2025-05-15T02:30:09.168Z",
    "relevanceReason": "Strong relevance detected by model (score: 10.46)"
  },
  {
    "id": "d7c49669-2b39-457d-a578-c85fa64c3ed8",
    "title": "Dallas Cowboys to play Philadelphia Eagles in NFL season opener",
    "url": "https://www.axios.com/local/dallas/2025/05/12/dallas-cowboys-philadelphia-eagles-season-opener",
    "date": "2025-05-12",
    "content": "May 12, 2025 -\nNews\nDallas Cowboys to play Philadelphia Eagles in NFL season opener\nNaheed Rajwani-Dharsi\n,\nTasha Tsiaperas\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nEagles running back Duce Staley went for 262 scrimmage yards on 30 touches in what became known as the \"Pickle Juice Game\" in 2000. Photo: Ronald Martinez/Allsport\n\nAmerica's Team will play America's No. 1 team in the NFL's 2025-26 season opener, the league announced Monday.\n\nWhy it matters: The Dallas Cowboys and Philadelphia Eagles have been rivals for decades but haven't faced off in Week 1 in 25 years.\n\nDallas will play at Philly on Sept. 4 in the season's first NFL game, intended to get football fans excited for the upcoming season.\n\nThe big picture: The Eagles are coming off a Super Bowl championship. The Cowboys are rebuilding after playing without quarterback Dak Prescott for months and ending last season 7-10.\n\nFlashback: Temperatures reached 109 degrees — even hotter on the turf —when the rivals last played on opening weekend on Sept. 3, 2000.\n\nThe matchup at Texas Stadium was the hottest game in NFL history. Eagles players used pickle juice to reduce muscle cramping, and won 41-14.\nCowboys quarterback Troy Aikman retired after the season ended.\n\nThe intrigue: Star Cowboys linebacker Micah Parsons will play against the team he grew up watching.\n\n\"Yeah yeah let's ball 😮‍💨🦁,\" the linebacker wrote on his Instagram story after the game was announced.\n\nBetween the lines: The Cowboys' viewership may have contributed to the NFL's decision to put them in the opening game.\n\nThe team averaged around 22.5 million national TV viewers last season, the NFL's second-highest viewership, per Sportico.\n\nState of play: The Eagles will have the upper hand as the defending Super Bowl champs, but there's still hope for the Cowboys.\n\nFormer offensive coordinator Brian Schottenheimer will debut as head coach, Prescott is expected to play, and wide receiver CeeDee Lamb will have help from newly acquired George Pickens.\n\nWhat's next: The game will air on NBC and Peacock. Tickets are on sale.\n\nThe Cowboys' full schedule will be released Wednesday.\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "The rivals last met in Week 1 in 2000.",
    "scrapedAt": "2025-05-15T02:30:40.596Z",
    "relevanceReason": "Strong relevance detected by model (score: 10.46)"
  },
  {
    "id": "11580e7d-206a-42f7-ae40-5c4add6fad88",
    "title": "Making Dallas a tourist destination",
    "url": "https://www.axios.com/local/dallas/2025/05/09/dallas-tourism-world-cup",
    "date": "2025-05-09",
    "city": "Dallas",
    "state": "TX",
    "content": "Could Dallas be a top tourist destination someday? Photo: Valerie Macon/AFP via Getty Images\n\nDallas has a branding problem. Of the 27 million visitors to the city last year, 80% were attending a meeting or convention, not because they chose it as a tourist destination.\n\nWhy it matters: Dallas is still best known for two things: the assassination of President John F. Kennedy and the long-running primetime soap opera that had everyone in the 1980s asking \"Who shot J.R.?\"\n\nThe big picture: Visitors spend a lot — about $6.6 billion a year — staying at hotels and going out in Dallas.\n\nReality check: When people think of a U.S. city to visit, they likely don't consider Dallas. Why would they when there's Chicago with its beautiful summers, music festivals and river boat tours?\n\nState of play: Visit Dallas is trying to show potential visitors that Dallas has a lot to offer, including our shopping, dining and arts culture.\n\nWhat they're saying: People know Dallas. That's not the problem. The problem is getting to see the city as something more than a 1980s stereotype.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "summary": "Could Dallas be a top tourist destination someday? Photo: Valerie Macon/AFP via Getty Images\n\nDallas has a branding problem",
    "source_url": "https://www.axios.com/local/dallas/2025/05/09/dallas-tourism-world-cup"
  },
  {
    "id": "d1200a19-5738-4807-86fc-76a08ca81f3c",
    "title": "Fort Worth ISD warned of possible state takeover",
    "url": "https://www.axios.com/local/dallas/2025/05/08/fort-worth-isd-state-takeover",
    "date": "2025-05-08",
    "content": "May 8, 2025 -\nEducation\nFort Worth ISD warned of possible state takeover\nNaheed Rajwani-Dharsi\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nIllustration: Allie Carl/Axios\n\nFort Worth ISD will have to make aggressive and immediate improvements after a district school repeatedly received failing scores in the state's accountability ratings, the Texas education commissioner warned district leaders this week.\n\nWhy it matters: The school shut down in 2023, merging with a middle school, but Fort Worth ISD will have to successfully appeal the most recent rating to avoid being taken over by the Texas Education Agency.\n\nCatch up quick: The TEA released preliminary 2023 ratings last month, delayed by a lawsuit filed by more than 120 school districts, including Fort Worth ISD.\n\nThe district received an overall D rating, and 77 of its 138 campuses received a D or F, considered failing by the state.\nThe sixth grade Leadership Academy at Forest Oak Middle School, previously known as the Glencrest sixth grade campus, did not meet state standards for five consecutive years, per the TEA.\n\nThe latest: TEA commissioner Mike Morath told district officials this week that he will look closely at district operations and leadership in the coming months.\n\n\"It is critical that district leadership take aggressive action to improve the academic lives of students in Fort Worth ISD,\" Morath wrote in a letter.\nThe district tells Axios it plans to appeal the preliminary rating. The ratings will be finalized in August.\n\nWhat they're doing: The district tells Axios in a statement that it has restructured its literacy and math curriculum and has a new strategic plan that includes academic performance, family engagement, employee retention and operational efficiency.\n\nThe district also has a new superintendent.\n\nThe fine print: State law requires the TEA to take over a district if any of its campuses get an unacceptable rating for five consecutive years.\n\nTakeovers typically replace the elected board of trustees and superintendent with a state-appointed board of managers and can affect students and staff if schools are closed or turned into charters.\nThe TEA decides when to return control to elected trustees.\n\nBetween the lines: It's rare for the state to take control of a school district.\n\nFrom 1993 to 2023, the state took over a school district 15 times, per the Houston Chronicle.\n\nZoom out: Houston ISD has been under state control since 2023 and could stay under state control until at least 2027, per the Texas Standard.\n\nThe state also took over South San Antonio ISD in February, citing years of governance failures and financial mismanagement.\n\nWhat's next: The TEA's 2024 ratings are delayed by a different lawsuit and haven't been released.\n\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "State officials are scrutinizing the district.",
    "scrapedAt": "2025-05-15T02:30:22.848Z",
    "relevanceReason": "Strong relevance detected by model (score: 10.46)"
  },
  {
    "id": "46d04677-d3f9-4be4-80f3-fae1a87248ab",
    "title": "Buying a home requires $63K more income than renting in Dallas-Fort Worth",
    "url": "https://www.axios.com/local/dallas/2025/05/07/dallas-fort-worth-home-buying-income",
    "date": "2025-05-07",
    "city": "Dallas",
    "state": "TX",
    "content": "Homebuyers in Dallas-Fort Worth need to earn over $63,000 more a year than renters to afford their monthly housing payments, according to a recent Redfin report.\n\nWhy it matters: A \"triple whammy\" of rising home prices, high mortgage rates and a shortage of houses for sale is making it harder for renters to make the leap to homeownership, the report says.\n\nState of sale: The household income required to afford a median home in North Texas has increased nearly 3% since last year. The income needed to pay the median rent has dropped close to 6% in the same time period, per Redfin.\n\nThe big picture: Nationally, homebuying costs are climbing faster than rents, which have softened due to an influx of newly built apartments.\n\nThe fine print: Redfin's analysis assumes a homebuyer or renter spends no more than 30% of their income on monthly payments.\n\nZoom in: Incomes and housing costs vary widely across the metro area.\n\nWhat's next: President Trump's tariffs are expected to raise construction costs for new houses, another hurdle for aspiring homeowners managing tight finances.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "summary": "Homebuyers in Dallas-Fort Worth need to earn over $63,000 more a year than renters to afford their monthly housing payments, according to a recent Redfin report.\n\nWhy it matters: A \"triple whammy\" of rising home prices, high mortgage rates and a shortage of houses for sale is making it harder for renters to make the leap to homeownership, the report says.\n\nState of sale: The household income required to afford a median home in North Texas has increased nearly 3% since last year",
    "source_url": "https://www.axios.com/local/dallas/2025/05/07/dallas-fort-worth-home-buying-income"
  },
  {
    "id": "aa83b5f4-a5b0-4054-9d99-beb03638a239",
    "title": "American Airlines, DFW Airport plan $4B terminal",
    "summary": "Terminal F is going to be fancy - click here to read more",
    "date": "2025-05-01",
    "city": "Dallas",
    "state": "TX",
    "content": "Terminal F is going to be fancy. Rendering: Courtesy of DFW Airport\n\nDFW Airport's sixth terminal will be almost double its originally planned size and will have only American Airlines flights, the airport announced Thursday.\n\nWhy it matters: The airport, almost midway between Dallas and Fort Worth, has been critical to the population and business growth of the region.\n\nThe big picture: DFW Airport was the world's third-busiest airport last year, following Atlanta and Dubai.\n\nThe latest: The Fort Worth-based airline plans to spend $4 billion on the terminal, which will have 31 gates and its own parking, baggage claims and security area.\n\nState of planes: American will operate exclusively in the terminal, freeing up gates at Terminal E for other domestic airlines.\n\nWhat they're saying: \"I've always called Terminal D the crown jewel of DFW Airport. When Terminal F opens, it's going to take that forward,\" Donohue said.\n\nBetween the lines: Construction in the terminals, on bridges and along International Parkway can snarl traffic near the airport.\n\nWhat's next: The first phase of Terminal F is scheduled to open in 2027. The terminal should be fully operational by 2030.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "source_url": "https://www.axios.com/local/dallas/2025/05/01/american-airlines-dfw-airport-terminal-f",
    "url": "https://www.axios.com/local/dallas/2025/05/01/american-airlines-dfw-airport-terminal-f"
  },
  {
    "id": "139b1d52-2563-4956-81a1-40c0132409e4",
    "title": "Fort Worth offers workforce training for high school students",
    "url": "https://www.axios.com/local/dallas/2025/04/29/fort-worth-workforce-training-mattie-parker",
    "date": "2025-04-29",
    "city": "Dallas",
    "state": "TX",
    "content": "Illustration: Allie Carl/Axios\n\nHundreds of Fort Worth high school students will graduate this year with a diploma and training that can put them directly into the workforce.\n\nWhy it matters: Dallas-Fort Worth and Texas as a whole continue to add thousands of skilled jobs, but not enough residents are trained to fill them.\n\nThe big picture: The U.S. is already facing a health care worker shortage, with many longtime workers retiring or quitting after COVID.\n\nHow it works: Fort Worth Mayor Mattie Parker launched the Council on Education and Workforce in 2022 to connect high schoolers with professional certification programs and internships.\n\nWhat they're saying: The programs help students decide what they love doing.\n\nDriving the news: Parker at an event last week congratulated the more than 300 Fort Worth high school seniors who earned professional certificates and finished internships this school year.\n\nBetween the lines: Training high school students is just one part of filling the skills gap. Businesses also offer training to prepare workers for jobs in a different industry.\n\nThe bottom line: Education at all levels is the best way to ensure people can earn an income and jobs are filled, the mayor says.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "summary": "Illustration: Allie Carl/Axios\n\nHundreds of Fort Worth high school students will graduate this year with a diploma and training that can put them directly into the workforce.\n\nWhy it matters: Dallas-Fort Worth and Texas as a whole continue to add thousands of skilled jobs, but not enough residents are trained to fill them.\n\nThe big picture: The U.S",
    "source_url": "https://www.axios.com/local/dallas/2025/04/29/fort-worth-workforce-training-mattie-parker"
  },
  {
    "id": "79ad99f7-fa7d-4d66-8baa-3c2008018200",
    "title": "Texas business execs report more tariff uncertainty",
    "url": "https://www.axios.com/local/dallas/2025/04/28/dallas-fed-tariffs-texas-business",
    "date": "2025-04-28",
    "content": "Apr 28, 2025 -\nNews\nTexas business execs report more tariff uncertainty\nTasha Tsiaperas\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nIllustration: Lindsey Bailey/Axios\n\nA majority of Texas business executives expect their companies to be negatively impacted by higher tariffs this year, per a Dallas Fed survey released Monday.\n\nWhy it matters: Retailers nationwide are warning that President Trump's trade war could trigger product shortages and price spikes as Chinese imports slow.\n\nMany Texas business leaders, including retailers, expect to pass cost increases from tariffs on to customers, per the new Dallas Fed survey.\n\nFlashback: Texas manufacturing activity fell in February in anticipation of Trump's tariffs.\n\nWhat they did: The Dallas Fed surveys business executives every month about employment and prices. The latest survey includes responses from 356 executives surveyed April 15-23.\n\nSurvey respondents also had the option to share comments anonymously about the impact of tariffs. Many reported feeling uncertain about their business outlooks.\n\nWhat they're saying: One business leader called the tariff policy \"a self-inflected pandemic.\"\n\n\"I feel the administration has done little to describe what the end game will be and has caused more uncertain[ty] by not explaining honestly what we American businesses will be facing,\" a food service executive wrote.\n\nThe other side: \"As we are an American manufacturer, it is positive protection to our business against cheap and low-labor-cost manufacturers around the world,\" an electronics manufacturer wrote.\n\nGo deeper: How tariffs can cause a recession\n\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "Many Texas business leaders, including retailers, expect to pass cost increases from tariffs to customers.",
    "scrapedAt": "2025-05-15T02:30:47.460Z",
    "relevanceReason": "Strong relevance detected by model (score: 8.50)"
  },
  {
    "id": "dbe3b0e3-a11b-4955-b719-ec6dd146c01f",
    "title": "Southwest and American report first-quarter losses amid economic uncertainty",
    "url": "https://www.axios.com/local/dallas/2025/04/25/southwest-american-delta-tariffs-business-outlook",
    "date": "2025-04-25",
    "city": "Dallas",
    "state": "TX",
    "content": "Illustration: Sarah Grillo/Axios\n\nU.S. airlines projected 2025 to be a strong year but are now adjusting their expectations in response to economic uncertainty and President Trump's tariffs.\n\nWhy it matters: American, Southwest and Delta say they are being cautious amid lower-than-expected leisure and business bookings in the first quarter of 2025.\n\nState of play: Dallas-based Southwest Airlines reported a net loss of $149 million in the first quarter of 2025.\n\nThe big picture: Airlines are trying to keep the Trump administration from ending 1980s-era exemptions that have allowed Boeing, Airbus and other aerospace manufacturers to build aircraft and jet engines largely without tariffs, per the Wall Street Journal.\n\nThe intrigue: American says its revenue from international flights increased by 2% in the first quarter of 2025 compared with the first quarter of 2024.\n\nMeanwhile: Southwest plans to reduce its flight capacity in the second half of this year.\n\nWhat's next: The 2026 FIFA Men's World Cup will bring \"tremendous\" interest in travel to the U.S., Isom said.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "summary": "Illustration: Sarah Grillo/Axios\n\nU.S",
    "source_url": "https://www.axios.com/local/dallas/2025/04/25/southwest-american-delta-tariffs-business-outlook"
  },
  {
    "id": "e9020699-ddc4-487f-baa2-83f6617c9ba7",
    "title": "Major League Cricket moving to Grand Prairie ahead of its third season",
    "url": "https://www.axios.com/local/dallas/2025/04/24/major-league-cricket-us-expansion-grand-prairie",
    "date": "2025-04-24",
    "city": "Dallas",
    "state": "TX",
    "content": "Six Major League Cricket teams will compete for this trophy this summer. Photo: Naheed Rajwani-Dharsi/Axios\n\nMajor League Cricket is moving its headquarters from San Francisco to Grand Prairie as part of its plans to grow the sport in the U.S.\n\nWhy it matters: Grand Prairie Stadium has become the epicenter of U.S. cricket.\n\nThe big picture: MLC matches are broadcast internationally. Millions tune in and thousands pack the stadiums, even on hot days.\n\nThe latest: Grand Prairie Cricket Stadium will host 12 regular-season MLC matches in the league's third season, along with the playoffs and the final.\n\nFollow the money: Last year's Men's T20 World Cup infused more than $100 million into the Texas economy, from lodging, flights and dining, league officials say.\n\nFun fact: MLC's new CEO, Johnny Grave, has worked in international cricket for almost 25 years and was most recently the CEO of Cricket West Indies.\n\nThe intrigue: Grand Prairie Mayor Ron Jensen, a longtime baseball fan, says he has become a cricket fan since attending the stadium's inaugural match in 2023.\n\nWhat's next: The Super Kings' first home game is June 20 against the San Francisco Unicorns. MLC tickets start at $20.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "summary": "Six Major League Cricket teams will compete for this trophy this summer",
    "source_url": "https://www.axios.com/local/dallas/2025/04/24/major-league-cricket-us-expansion-grand-prairie"
  },
  {
    "id": "96beb735-3f12-4d42-af38-80cb1d391237",
    "title": "North Texas schools downgraded in state's new ratings",
    "url": "https://www.axios.com/local/dallas/2025/04/24/dallas-fort-worth-school-ratings-tea",
    "date": "2025-04-24",
    "content": "Apr 24, 2025 -\nNews\nNorth Texas schools downgraded in state's new ratings\nTasha Tsiaperas\n,\nAsher Price\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nIllustration: Megan Robinson/Axios\n\nFort Worth ISD is at risk of a state takeover under Texas' new A-F ratings, which were released yesterday.\n\nWhy it matters: More Texas schools are getting failing grades under the rating system, whose release was delayed by years of legal challenges.\n\nThe results come as public school advocates are fighting for resources from state lawmakers who have passed legislation establishing a $1 billion private school voucher program.\n\nFriction point: More than 120 school districts tried to block the release of the 2023 ratings, saying the Texas Education Agency had not given them enough notice before revising their standards.\n\nThe updated standards require high schools to send 88% of their seniors to college, a trade or technical school, or the military, compared to 60% in the past. Districts said this increased metric would result in unfair drops in their ratings.\nAn appeals court this month cleared the way for the ratings' release.\n\nZoom in: A now-closed Fort Worth school had five consecutive years of failing ratings, putting the district at risk of takeover, per the Star-Telegram.\n\n43 campuses received an F in the newly-released ratings. 10 received an A. The district got a D rating.\n\nZoom out: Dallas ISD received a C, with 47 campuses getting an A and 8 getting an F.\n\nCarroll, Frisco and Highland Park school districts received an A.\nHEB, Lewisville and Plano got a B.\nArlington, Carrollton-Farmers Branch, Irving and Richardson ISDs received a C.\nCrowley, DeSoto and Lancaster ISDs got Ds.\n\nBy the numbers: 78% of all rated schools statewide received a passing accountability rating, compared with 93% in 2022. Also in 2023, 22% of rated schools had D or F grades, which are considered failing.\n\nSearch for school ratings here.\n\nEditor's note: This story has been updated with the share of rated schools that got passing and failing grades.\n\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "Dallas ISD received a C.",
    "scrapedAt": "2025-05-15T02:30:15.730Z",
    "relevanceReason": "Strong relevance detected by model (score: 8.50)"
  },
  {
    "id": "b9d2ea84-0cdc-49cc-8227-fee1581d78cc",
    "title": "Weekend events in Dallas April 24-27",
    "url": "https://www.axios.com/local/dallas/2025/04/24/dallas-weekend-events",
    "date": "2025-04-24",
    "content": "Apr 24, 2025 -\nNews\nWeekend events in Dallas April 24-27\nTasha Tsiaperas\n,\nNaheed Rajwani-Dharsi\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nUpdate your Hinge profile pic here. Photo: Courtesy of The Shops at Park Lane\n\nHere's what's happening in North Texas this weekend.\n\n🤳 Snap a pic. The Shops At Park Lane have set up a walk-in \"Terrarium in Bloom\" globe for photos. The installation will be open until the end of May.\n\n🏏 Learn about wickets. The USA women's cricket team is hosting Zimbabwe for a five-match series. It will be the first time the U.S. women's team has played international matches in North Texas.\n\nFriday through May 3 at Grand Prairie Stadium. Free entry.\n\n🌳 Everyone (in Irving) gets a tree! Irving residents can pick up a free tree to celebrate Arbor Day, 9am-noon Saturday at City Hall.\n\n🇮🇳 Find happiness. Klyde Warren Park is hosting the Festival of Joy, an Indian cultural event that includes dance performances, live music, vegetarian food and vendors. The free event is 11am-9pm Saturday.\n\n🍕 Slices for hours. The Dallas Pizza Fest will have live music, a beer garden and, of course, pizza.\n\nNoon-8pm Sunday at EpicCentral in Grand Prairie. Free entry. $20 to enter a pizza eating contest.\n\n🕺 Step in time. The Heart of Texas Line Dance Event is hosting workshops and social dances Thursday night through Sunday at the Hyatt Regency DFW in Grapevine.\n\nRegistration at the door only. $45 for the evening dances. ​\n\n🦞 Slurp crawfish. M9:23 Food Yard and Event Center in Forney is hosting a Crawfish & Music Festival.\n\n4pm Friday and 1pm Saturday and Sunday. Tickets are $8.\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "Watch cricket, dance, eat pizza, slurp crawfish, attend an Indian cultural event.",
    "scrapedAt": "2025-05-15T02:30:54.721Z",
    "relevanceReason": "Strong relevance detected by model (score: 10.46)"
  },
  {
    "id": "adc3e600-4994-44fa-a0e4-8179805fbbe9",
    "title": "Dallas-based film festival is back for 55th year",
    "url": "https://www.axios.com/local/dallas/2025/04/24/dallas-usa-film-festival-angelika-film-center",
    "date": "2025-04-24",
    "content": "Apr 24, 2025 -\nNews\nDallas-based film festival is back for 55th year\nTasha Tsiaperas\n,\nNaheed Rajwani-Dharsi\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nThe 1975 film starring David Carradine will be screened Saturday. Photo: LMPC via Getty Images\n\nThe 55th annual USA Film Festival is underway at the Angelika Film Center in Dallas.\n\nState of play: The Dallas-based group hosts its annual spring festival and classic film showings throughout the year at the Mockingbird Station movie theater.\n\nThe festival opened Wednesday night as part of Dallas Arts Month, which recognizes local artists.\n\nZoom in: The event continues through Sunday and includes feature films, documentaries and short films.\n\nSeveral actors and filmmakers are scheduled to attend showings of their movies. \"Cobra Kai\" actor Martin Kove will attend Saturday night's 50th anniversary screening of \"Death Race 2000.\"\nSunday's events include a showing of shorts from Sachse High School digital media students.\n\nIf you go: Most showings are free. Online ticket registration is closed for a few of the films, but limited tickets are still available at the box office an hour before showtime.\n\nSeparately, the Angelika is also showing \"Pride and Prejudice\" and \"Star Wars: Revenge of the Sith\" for their 20th anniversaries.\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "Most screenings are free.",
    "scrapedAt": "2025-05-15T02:31:01.806Z",
    "relevanceReason": "Strong relevance detected by model (score: 10.46)"
  },
  {
    "id": "18722404-d5e0-46a3-98e1-6b14f8bf7b0f",
    "title": "Dallas-Fort Worth runs afoul of federal air standards",
    "url": "https://www.axios.com/local/dallas/2025/04/22/dallas-fort-worth-ozone-air-pollution",
    "date": "2025-04-22",
    "city": "Dallas",
    "state": "TX",
    "content": "Biking along the Trinity Trail is not advised on an ozone action day. Photo: Robert Nickelsberg/Getty Images\n\nDallas-Fort Worth polluters could face $45 million in yearly federal fines if the region's air quality doesn't improve by 2027.\n\nWhy it matters: Air pollution is a serious threat to health, particularly for children, elderly people and those who have asthma or other lung conditions.\n\nThe latest: D-FW has seen an early start to the ozone season, which lasts through November.\n\nThe big picture: Nearly 40% of Americans live in areas with unhealthy levels of ozone or particle pollution, according to the American Lung Association's latest \"State of the Air\" report on ground-level ozone.\n\nZoom in: Dallas, Tarrant, Collin and Denton counties all received Fs in the report.\n\nThreat level: Ozone levels last year in D-FW reached 83 parts per billion, well above federal standards.\n\nContext: The EPA's strictest air quality standard, set in 2015, sets an ozone limit of 70 ppb.\n\nBetween the lines: President Trump has targeted environmental regulations, including by attempting to end bans on \"forever chemicals\" and boosting U.S. oil and gas production.\n\nYes, but: D-FW has fewer high ozone days now than it did 20 years ago.\n\nWorthy of your time: Read how to reduce pollution in Dallas-Fort Worth.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "summary": "Biking along the Trinity Trail is not advised on an ozone action day",
    "source_url": "https://www.axios.com/local/dallas/2025/04/22/dallas-fort-worth-ozone-air-pollution"
  },
  {
    "id": "ff89ef3d-45fb-45c5-a6d2-cd60fa4ca3cf",
    "title": "How to reduce pollution in Dallas-Fort Worth",
    "url": "https://www.axios.com/local/dallas/2025/04/22/dallas-fort-worth-reduce-pollution",
    "date": "2025-04-22",
    "content": "Apr 22, 2025 -\nNews\nHow to reduce pollution in Dallas-Fort Worth\nTasha Tsiaperas\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nTaking the train can reduce pollution. Photo: Rebecca Smeyne/Bloomberg via Getty Images\n\nRidesharing, telecommuting and taking public transit can reduce the pollution that contributes to the poor air quality in Dallas-Fort Worth.\n\nWhy it matters: Industrial businesses are major polluters, but individuals can still have a positive impact on the region's air quality.\n\nSimply switching from gas-powered to electric lawn equipment is equivalent to removing hundreds of cars from the road, according to Environment Texas.\n\nThe big picture: The North Central Texas Council of Governments (NCTCOG), a group of more than 200 local governmental entities, has developed a plan to try to get the region into compliance with federal air quality standards.\n\nThe region is currently classified as a severe nonattainment zone by the EPA.\n\nState of commute: The NCTCOG is working with cities to improve signal timing that would keep cars from idling long at red lights.\n\nThe organization also has an app and website, tryparkingit.com, that gives commuters public transit and carpooling options.\n\nThreat level: Medium levels of ozone can cause detrimental health effects for the nearly 1 million North Texas residents who have asthma or chronic lung disease.\n\nHigher levels of ozone can be unhealthy for even the healthiest groups.\n\nHow you can help: If it's an ozone action day, limit driving or make trips later in the day when fewer cars are on the road. Turn off your engine to avoid idling.\n\nLearn about air quality through AirNorthTexas.org.\n\nWorthy of your time: Read about how Dallas-Fort Worth runs afoul of federal clean air standards.\n\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "Industrial businesses are major polluters, but individuals can still have a positive impact on the region's air quality on ozone action days.",
    "scrapedAt": "2025-05-15T02:31:08.208Z",
    "relevanceReason": "Strong relevance detected by model (score: 12.46)"
  },
  {
    "id": "311e253f-981e-4280-b72d-7fe865799956",
    "title": "Mavericks GM Harrison defends Dončić trade",
    "url": "https://www.axios.com/local/dallas/2025/04/21/mavericks-nico-harrison-luka-doncic",
    "date": "2025-04-21",
    "city": "Dallas",
    "state": "TX",
    "content": "Nico Harrison before the Mavericks played the Memphis Grizzlies on April 18 for a spot in the playoffs. The Mavericks lost. Photo: Justin Ford/Getty Images\n\nDallas Mavericks GM Nico Harrison doubled down on his belief that \"defense wins championships\" in an end-of-season news conference Monday.\n\nWhy it matters: Harrison said that he knew former Mav Luka Dončić \"was important to the fan base\" but \"didn't quite know to what level\" before trading him to the Los Angeles Lakers for Anthony Davis.\n\nDriving the news: The news conference comes less than a week after a closed doors roundtable with reporters and Harrison. No cameras or recordings were allowed, which didn't play well for Harrison among fans and on social media.\n\nThe intrigue: Hours before the planned news conference, ESPN published a report detailing what it described as dysfunction and discord in the Mavs front office.\n\nBetween the lines: The Mavs were plagued with injuries before and after Dončić was traded. Davis was hurt in his first game, Kyrie Irving suffered a season-ending ACL injury, and Dereck Lively II missed months with a stress fracture.\n\nThe bottom line: \"I think I've done a really good job here. I don't think I can be judged by the injuries this year,\" Harrison said when asked why he shouldn't be fired. \"You'll see next year when our team comes back, we're going to be competing for a championship.\"\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "summary": "Nico Harrison before the Mavericks played the Memphis Grizzlies on April 18 for a spot in the playoffs",
    "source_url": "https://www.axios.com/local/dallas/2025/04/21/mavericks-nico-harrison-luka-doncic"
  },
  {
    "id": "d61889a7-a2b1-466a-9a2c-ce6cdd7db090",
    "title": "Former Dallas bishop temporarily leads Catholic Church",
    "url": "https://www.axios.com/local/dallas/2025/04/21/dallas-pope-francis-kevin-joseph-farrell",
    "date": "2025-04-21",
    "content": "Apr 21, 2025 -\nNews\nFormer Dallas bishop temporarily leads Catholic Church\nAvery Lotz\n,\nNaheed Rajwani-Dharsi\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nDallas bishop Kevin Joseph Farrell (center) was appointed a cardinal in 2016 at St. Peter's Basilica in the Vatican. Photo: Franco Origlia/Getty Images\n\nA former Dallas bishop is in charge of the Catholic Church until a new pope is chosen.\n\nDriving the news: Pope Francis, 88, died the day after attending Easter services at St. Peter's Basilica and weeks after he was released from an extended hospital stay for pneumonia.\n\nCardinal Kevin Joseph Farrell, 77, who was bishop of the Catholic Diocese of Dallas from 2007 to 2016, now holds one of the most powerful positions in the church as its chamberlain.\n\nThe latest: Farrell announced Pope Francis' death Monday and presided over the certification of the pope's death and laying of his body in a coffin.\n\nHe was also tasked with securing the pope's room and removing the papal ring, the New York Times reported. The piece of jewelry is destroyed after a pope's death, and a new one is forged for the next leader.\n\nFlashback: Francis appointed the Irish-born Farrell as chamberlain of the Holy Roman Church in 2019, giving him the authority to temporarily lead the church after his death.\n\nLast year, Francis appointed Farrell to also preside over the Vatican City State Supreme Court.\n\nHis final words: \"I would like all of us to hope anew and to revive our trust in others, including those who are different than ourselves, or who come from distant lands, bringing unfamiliar customs, ways of life and ideas,\" the progressive pontiff shared in his final Easter message.\n\nZoom in: The Catholic Diocese of Dallas held a Mass on Monday in downtown Dallas in honor of Pope Francis. Near the front sat a photo of the pope releasing a dove and smiling.\n\n\"I find it amazing that on Easter Sunday, our Holy Father was in St. Peter's Square in the Vatican, with the faithful. … In his ill health, he saw the need to be with the flock,\" Bishop Edward J. Burns said during the Mass.\n\nWhat's next: Faith leaders, mourners and international officials are expected to visit the Vatican in the coming days for a public viewing and Mass.\n\nThe pope chose to be buried at the Saint Mary Major Basilica in Rome, reflecting his simplicity and willingness to carve a nontraditional path.\nChurch leaders will gather for a secretive vote to decide who will be the 267th pope.\n\nMore from Axios:\n\nTrump to attend Pope Francis' funeral\nHow long the 10 most recent popes reigned\nPope Francis picked 80% of cardinals who'll elect his successor\nRead: Pope's wishes to be laid to rest in a \"simple\" tomb in Rome\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "Cardinal Kevin Joseph Farrell, 77, was bishop of the Catholic Diocese of Dallas from 2007 to 2016.",
    "scrapedAt": "2025-05-15T02:29:55.759Z",
    "relevanceReason": "Strong relevance detected by model (score: 10.46)"
  },
  {
    "id": "8969c83e-6d40-462a-a3c3-7a9fb0bdee9d",
    "title": "More anti-Trump protests planned in Dallas-Fort Worth",
    "url": "https://www.axios.com/local/dallas/2025/04/17/anti-trump-protests-dallas-fort-worth",
    "date": "2025-04-17",
    "content": "Apr 17, 2025 -\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nTasha Tsiaperas\n,\nApril Rubin\n,\nSareen Habeshian\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\n\"Hands Off\" protesters rallied April 5 in Dallas. More protests are planned this weekend in Fort Worth. Photo: Jan Sonnenmair/Getty Images\n\nWidespread protests against the Trump administration are planned nationwide, including in North Texas, on Saturday.\n\nWhy it matters: The 50501 Movement — meaning 50 protests, 50 states, 1 movement — is building on momentum from recent protests to push back against what organizers call executive overreach from the Trump administration.\n\n\"Our movement shows the world that the American working class will not sit idly by as plutocrats rip apart their democratic institutions and civil liberties while undermining the rule of law,\" the movement's website said.\n\nDriving the news: More than 400 events are scheduled nationwide for Saturday, including rallies, protests, nature cleanups and food drives.\n\nA protest in Fort Worth is planned for noon-4pm Saturday at Burk Burnett Park.\n\nThe intrigue: Most of the organizing has taken place on Reddit.\n\nBetween the lines: The protests come as President Trump's approval ratings have dipped significantly.\n\nZoom in: Thousands of protesters gathered April 5 across North Texas as part of the nationwide \"Hands Off!\" campaign against Trump's policies and Elon Musk's involvement in the federal government as an unelected official.\n\nProtesters rallied in Arlington, Dallas, Denton, Flower Mound and Frisco.\nFort Worth did not have an organized protest that day, but at least 100 people gathered outside a Tesla dealership, per the Fort Worth Weekly.\n\nContext: Saturday's effort isn't just about protesting. Some groups are also planning donation drives, clothing swaps or meetings to discuss future action, organizers said.\n\n\"We need to think about the America we want to see, where we have empathy and help each other, and just become that,\" organizers wrote.\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "The 50501 Movement will protest in Fort Worth on Saturday.",
    "scrapedAt": "2025-05-15T02:30:02.776Z",
    "relevanceReason": "Strong relevance detected by model (score: 13.24)"
  },
  {
    "id": "9db989a5-4180-4e38-a1ab-c94563a218c4",
    "title": "Denton debuts Texas' first electric fire truck",
    "url": "https://www.axios.com/local/dallas/2025/04/16/denton-texas-electric-fire-truck",
    "date": "2025-04-16",
    "city": "Dallas",
    "state": "TX",
    "content": "The fire truck will be housed in Denton's Station 1. Screenshot: YouTube\n\nA new fire truck in Denton can go from call to call without burning any fuel.\n\nWhy it matters: The engine is the first electric fire truck in Texas, per fire apparatus maker Pierce Manufacturing.\n\nDriving the news: Denton residents joined the Fire Department in a ceremony last week to wash the new truck and help push it into its new home.\n\nThe intrigue: Fire Station 1, where the Pierce Volterra truck is located, sits on the site of Denton's first diesel plant, which was built in 1935.\n\nHow it works: The new truck's exterior looks similar to Denton's other engines, but there is more space inside the cab.\n\nFun fact: \"It's extremely quiet. I think we've all been very surprised by that,\" Scott Beckwith, a sales representative at Siddons Martin Emergency Group, said in a video introducing Denton's fire truck.\n\nFollow the money: The electric truck cost the city $1.8 million, about $600,000 more than a diesel-powered truck, per WFAA.\n\nWhat they're saying: \"The addition of Texas' first electric fire truck marks a new era for the Denton Fire Department and the future of emergency response,\" Denton Fire Chief Kenneth Hedges said in a statement.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "summary": "The fire truck will be housed in Denton's Station 1",
    "source_url": "https://www.axios.com/local/dallas/2025/04/16/denton-texas-electric-fire-truck"
  },
  {
    "id": "a51ed4e0-7449-465e-acc9-680797b15273",
    "title": "Dallas heat islands can be 12 degrees hotter than other neighborhoods",
    "url": "https://www.axios.com/local/dallas/2025/04/16/dallas-heat-islands",
    "date": "2025-04-16",
    "content": "Apr 16, 2025 -\nNews\nDallas heat islands can be 12 degrees hotter than other neighborhoods\nTasha Tsiaperas\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nNot all of Dallas is concrete and high-rises. Nature, like Five Mile Creek, is tucked in there too. Photo: Tasha Tsiaperas/Axios\n\nThe average temperature in Dallas-Fort Worth was nearly 6 degrees warmer than normal last month, per the National Weather Service, but some neighborhoods likely felt much hotter.\n\nWhy it matters: Dallas has mapped its heat islands for two years now, helping city planners determine which neighborhoods need more trees.\n\nConcrete urban settings can make a hot day feel worse, while tree-lined streets and less concrete can have a cooling effect.\n\nThe big picture: Urban heat islands are a problem nationwide, but the burden isn't equally shared. Historically segregated neighborhoods tend to experience higher temperatures than white communities.\n\nResearchers have released reports illustrating heat disparity in other U.S. cities this year, including Charlotte, North Carolina, and Santa Fe, New Mexico.\n\nDriving the news: Lush green space in Dallas was about 12 degrees cooler than the hottest parts of town on Aug. 10, 2024, when the temperature reached 101 degrees.\n\nAn updated joint study by the City of Dallas and the National Oceanic and Atmospheric Administration has now mapped 350 square miles of the city over two years to identify the hottest neighborhoods.\n\nWhat they found: Built-up areas around highways and major roads stayed hot throughout the day, whereas neighborhoods near preserved land with a lot of trees on their streets stayed cooler.\n\nThe difference can be seen in North Oak Cliff, where Bishop Arts was hotter than the neighborhood around nearby Stevens Park.\nDowntown, Oak Lawn, the Harwood area, West Dallas and Love Field are among the hottest areas.\n\nThe intrigue: Some Dallas neighborhoods can be in the low 70s at 6am while hotter neighborhoods start the day above 82 degrees.\n\nThreat level: Even with reduced emissions, researchers write, temperatures are still expected to rise in the coming decades.\n\nWith high emissions, the average daily maximum temperature could increase 4 degrees by the 2060s. Even with low emissions, the temperature could rise 2 degrees.\nDallas County could see 10 more days a year with a high over 90 degrees within 20 years.\n\nThe bottom line: City leaders plan to use the data to plant more trees in neighborhoods that have been identified as heat islands.\n\nThe city is already prioritizing adding park space to give every resident access to greenspace within a short walk from their home.\n\nGo deeper: See how hot your neighborhood is.\n\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "Downtown, Oak Lawn, the Harwood area, West Dallas and Love Field are among the hottest areas.",
    "scrapedAt": "2025-05-15T02:30:29.350Z",
    "relevanceReason": "Strong relevance detected by model (score: 10.96)"
  },
  {
    "id": "4430eb2a-561d-477b-a6b1-afb8b09021be",
    "title": "next year's FIFA World Cup",
    "url": "https://www.axios.com/local/dallas/2025/03/11/dallas-fort-worth-dfw-dffw-dfwaf",
    "date": "2025-03-11",
    "content": "Mar 11, 2025 -\nNews\nBecoming D-FW AF\nNaheed Rajwani-Dharsi\n,\nTasha Tsiaperas\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nPlaces like this in Frisco have put the city on the map. Photo: Orlando Ramirez/Getty Images\n\nOur Big Dallas Energy has become more D-FW AF — to include Arlington and Frisco.\n\nWhy it matters: For a long time, the region has been described by its two most populous cities, but some leaders have suggested the name \"Dallas-Fort Worth\" should be more inclusive of the region's explosive growth.\n\nState of play: Frisco Mayor Jeff Cheney recently made a reference to \"DFFW,\" a term used to describe North Texas as Dallas, Frisco and Fort Worth.\n\n\"We're well on our way to being like an Austin, bringing these startups. We're becoming kind of the epicenter for that. Certainly, we're a global city,\" the mayor said at an event where he talked about the city's growth.\nThe Dallas Sports Commission refers to the region as \"DFW-AF\" as it prepares for the 2026 FIFA World Cup, executive director Monica Paul said at a separate event hosted by D Magazine last month.\n\"It takes everybody and every city — but it's also the conferences, the universities, our corporations, the facilities, and our leagues and teams here,\" Paul said.\n\nFlashback: Last year, Arlington Mayor Jim Ross disagreed with FIFA's decision to rename AT&T Stadium to Dallas Stadium for the nine World Cup matches that will be hosted there.\n\n\"Dallas is the big boy in the metroplex, and we love and appreciate everything Dallas does, but Arlington brings millions of millions of people here. To come in and call this Dallas Stadium doesn't do justice for who we are,\" Ross told the DMN.\n\nReality check: Plano could use more love, too. The city has hundreds of corporate and regional company headquarters.\n\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "Some say the new moniker fits.",
    "scrapedAt": "2025-05-15T02:29:49.258Z",
    "relevanceReason": "Strong relevance detected by model (score: 8.50)"
  },
  {
    "id": "75bbcb5d-0280-46ca-9627-e93d1afe4b2d",
    "title": "Dallas City Council approves $49 million City subsidy to support West End Lofts Project",
    "summary": "On December 11, the Dallas City Council unanimously approved a $49 million incentive package to support the development of the West End Lofts Project, a proposed mixed-use, mixed-income, and transit-oriented development project - click here to read more",
    "date": "2024-12-12",
    "city": "Dallas",
    "state": "TX",
    "content": "On December 11, the Dallas City Council unanimously approved a $49 million incentive package to support the development of the West End Lofts Project, a proposed mixed-use, mixed-income, and transit-oriented development project. The project will be developed on three existing parcels within the historic West End addressed as 805 Elm Street, 711 Elm Street, and 211 N. Austin Street within and adjacent to the City Center tax increment financing (TIF) district. The proposed project, led by Sycamore Strategies, LLC, is directly south of the West End DART light rail station and directly north of El Centro (Dallas College). “This is an exciting project that will convert underutilized/vacant historic buildings and surface parking lots into active residential and commercial uses abutting the West End DART light rail station and across the street from El Centro College,” said City Councilmember Paul Ridley (District 14), a member of the City Council’s Economic Development Committee. Council Member Ridley added, “With the reconstruction and expansion of the Kay Bailey Hutchison Convention Center and impactful projects such as West End Lofts, we can expect to see significant positive changes to the west side of downtown Dallas over the next several years.” The estimated $103.2 million project will include 154 mixed-income apartments comprised of 56 efficiencies, 25 one-bedroom, 69 two-bedroom, and 4 three-bedroom units to be constructed within the historic 805 Elm Street building and in a new 6-story building to be constructed on the existing adjacent surface parking lot. Of the 154 apartments, 63 (41%) will be income-restricted and leased solely to households earning at or below 30%, 60%, 70%, and 80% area family median income. Additionally, the project will include the development of residential amenities, rehabilitation of approximately 26,462 gross square feet of ground floor retail/commercial space, creation of an approximately 25,751 square foot plaza and promenade (open space), and rehabilitation of approximately 140 parking spaces in the historic 711 Elm Street parking garage. The project’s funding includes $54,224,085 in non-City sources, including equity in the form of low income housing tax credits and historic rehabilitation tax credits. The City’s incentive package includes an amount not to exceed $28,275,676 in City Center TIF District funding as well as up to $20,724,324 from other economic development funding sources administered by the City’s Office of Economic Development, including general obligation bond proceeds from the economic development/housing propositions in the City’s 2012 and 2024 bond programs.  \"The West End Lofts development is about more than apartments to us. It is a chance to revitalize and transform an area of downtown with a brand new pedestrian plaza, street-level retail, workforce housing and the preservation of two pieces of Dallas history,\" said Zachary Krochtengel of Sycamore Strategies. \"The City of Dallas has been an essential and invaluable partner to us, and we are extremely grateful for their support.\"“The City’s dedication to working with the West End Lofts Project development team is a prime example of how public-private partnerships can bring meaningful development to areas in need of an economic development boost,” said Kimberly Bizor Tolbert, Interim City Manager for the City of Dallas. “This important project will provide much needed affordable housing and ground floor activation within downtown’s West End Historic District. Prior to City Council consideration of the City subsidy for the project, the City Center TIF District Board of Directors unanimously recommended the use of City Center TIF District funding for this project, with the added condition that best efforts be made to provide a minimum of two square feet per residential unit for pet relief facilities. It is exciting to think of adding housing stock that will be occupied with individuals, families, and their pets, helping to grow the live-work-play spirit of downtown Dallas.”",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1089",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1089"
  },
  {
    "id": "8d38248d-1a27-4a93-9f59-80c910ae3e97",
    "title": "Dallas Supports $8 M Grant for the Historic Forest Theater",
    "summary": "On November 13,  the Dallas City Council unanimously approved an $8 million community development grant to support Forest Forward’s redevelopment of the historic Forest Theater, a key cultural and physical asset that has been closed since 2008 - click here to read more",
    "date": "2024-11-14",
    "city": "Dallas",
    "state": "TX",
    "content": "On November 13,  the Dallas City Council unanimously approved an $8 million community development grant to support Forest Forward’s redevelopment of the historic Forest Theater, a key cultural and physical asset that has been closed since 2008.  Located at 1918 Martin Luther King Jr. Boulevard in South Dallas’s Forest District, the theater is the focal point of a revitalization project estimated to cost $81 million. Forest Forward has already invested over $15 million in selective demolition and environmental remediation efforts.“This project is revitalizing a cherished community asset, and its significance extends far beyond the theater itself,” said Deputy Mayor Pro Tem Adam Bazaldua (District 7), a member of the City Council’s Economic Development Committee. “While the physical restoration of the Forest Theater is vital, the real value lies in the community collaboration and the lasting positive impact this project will have for generations to come.”The project includes:Comprehensive rehabilitation of the 35,630-square-foot, 75-year-old Forest Theater, in accordance with the Secretary of the Interior’s Standards for Rehabilitation. This will include the 500-seat main theater and lobby;New construction of an approximately 28,000-square-foot building addition to provide more lobby space and a 175-seat black box theater;Additional improvements, such as a café, rooftop deck, lawn for special events, and streetscape enhancements on Harwood Street to support public events and festivals.Upon completion, the redeveloped Forest Theater facility is expected to host more than 140 events annually.“With the support of the City of Dallas, the iconic Forest Theater will shine again in South Dallas. Not only will this investment bring the theater back to life, but it will create jobs, provide vital cultural space for the community, and deliver significant economic benefits,” said Elizabeth Wattley, President and CEO of Forest Forward. “We are grateful for the dedication of the City’s Office of Economic Development and for the continued support of Deputy Mayor Pro Tem Adam Bazaldua.”Forest Forward, a non-profit organization founded in 2020, was created specifically to revitalize the Forest Theater and works closely with the South Dallas community to drive equitable development, economic mobility, and improved outcomes for children, residents, and families. Forest Forward acquired the Forest Theater property in 2021.The City’s $8 million community development grant will include $7 million from the City’s Infrastructure Investment Fund, a funding source established in 2023 to make targeted infrastructure investments in Economic Development Target Areas. The Infrastructure Investment Fund and the Community Development Program are part of new initiatives introduced last year under the City Council’s updated Economic Development and Incentive Policies, designed to address economic disparities and outcomes in historically underserved communities through strategic policy, public investment, and partnership.“Supporting a project like the Forest Theater is a prime example of why the City of Dallas updated its Economic Development Incentive Policy last year,” said Kimberly Bizor Tolbert, Interim City Manager for the City of Dallas. “Providing this funding to a valued non-profit partner like Forest Forward to support the revitalization of the Forest Theater aligns perfectly with the goals of our Office of Economic Development’s Community Development Program, and I’m thrilled that this project will be the first to benefit from our Infrastructure Investment Fund.”",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1086",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1086"
  },
  {
    "id": "f7202e6a-2b38-464a-94d7-dad56612d878",
    "title": "Frisco",
    "url": "https://www.axios.com/local/dallas/2022/01/20/freakonomics-moving-to-dallas",
    "date": "2022-01-20",
    "content": "Jan 20, 2022 -\nNews\nFreakonomics covers why everyone's moving to Dallas\nTasha Tsiaperas\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nSure is a pretty skyline. Photo: Valerie Macon for AFP via Getty Images\n\nLifelong New Yorker and Freakonomics host Stephen Dubner had one question: What's the deal with Dallas and why are so many people moving here?\n\nThe first episode of a two-part series on the appeal of Dallas dropped Wednesday.\n\nWhy it matters: Austin gets a lot of attention for attracting Elon Musk and Joe Rogan. Houston is allegedly more neighborly. But Dallas-Fort Worth is an economic powerhouse that will likely become the nation's third-largest metro area.\n\nDubner's interest was sparked by an article claiming Dallas-Fort Worth has become the \"de facto capital of America's Heartland.\"\n\nThe big picture: The region's population is projected to reach 10 million people in the 2030s, ranking in size behind only New York City and Los Angeles.\n\nWhat they're saying: \"My biggest surprise was not just the massive population growth in the counties just north of Dallas, but the incredible diversity of that growth,\" Dubner tells Axios. He'll delve into that issue next week.\n\nDubner has no plans to move here but says he looks forward to future visits: \"Now all I need to do is arrange to play some golf with Jordan Spieth, which we tried this time but failed.\"\n\nThe intrigue: The episode delves into the council-manager form of government in Dallas, which means the mayor doesn't actually hold much power. Dubner talks to the current mayor, Eric Johnson, and former mayor Laura Miller.\n\n\"Dallas is a wonderful place to live with a totally awful city government,\" Miller says in the episode.\nFreakonomics also doesn't shy away from Dallas' racist history and how segregated the city remains today.\n\nOf note: The coverage isn't all about population and politics. Dubner dedicates a chunk of the first episode to dining at Sonny Bryan's Smokehouse.\n\nHe says the meat potato \"is maybe the best food on earth.\"\n\nHow to listen: Go to freakonomics.com or, you know, wherever you listen to podcasts. The episode will also air soon on KERA.\n\nfacebook (opens in new window)\ntwitter (opens in new window)\nlinkedin (opens in new window)\nnextdoor (opens in new window)\nemail (opens in new window)\n\nGet more local stories in your inbox with Axios Dallas.\n\nSubscribe\nMore Dallas stories\nNews\nMaking Dallas a tourist destination\nMay 9, 2025\nGo deeper (1 min. read)\nPolitics & Policy\nFormer Dallas bishop temporarily leads Catholic Church\nApr 21, 2025\nGo deeper (1 min. read)\nNews\nMore anti-Trump protests planned in Dallas-Fort Worth\nApr 17, 2025\nGo deeper (1 min. read)\nNews\nWhy Dallas-Fort Worth embraces the sprawl\nMay 1, 2025\nGo deeper (2 min. read)\nNews\nWhat's on the May 3 ballot in Dallas-Fort Worth\nApr 30, 2025\nGo deeper (1 min. read)\nMore stories\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSubscribe\n🌱\n\nSupport local journalism by becoming a member.\n\nLearn more",
    "source": "Axios Dallas",
    "source_url": "https://www.axios.com/local/dallas/news",
    "city": "",
    "state": "",
    "summary": "Dallas-Fort Worth is on track to become the nation’s third-largest metro area. Freakonomics delves into the city's growth.",
    "scrapedAt": "2025-05-15T02:31:22.541Z",
    "relevanceReason": "Strong relevance detected by model (score: 9.46)"
  }
]