[
  {
    "id": "aa83b5f4-a5b0-4054-9d99-beb03638a239",
    "title": "American Airlines, DFW Airport plan $4B terminal",
    "summary": "Terminal F is going to be fancy - click here to read more",
    "date": "2025-05-01",
    "city": "Dallas",
    "state": "TX",
    "content": "Terminal F is going to be fancy. Rendering: Courtesy of DFW Airport\n\nDFW Airport's sixth terminal will be almost double its originally planned size and will have only American Airlines flights, the airport announced Thursday.\n\nWhy it matters: The airport, almost midway between Dallas and Fort Worth, has been critical to the population and business growth of the region.\n\nThe big picture: DFW Airport was the world's third-busiest airport last year, following Atlanta and Dubai.\n\nThe latest: The Fort Worth-based airline plans to spend $4 billion on the terminal, which will have 31 gates and its own parking, baggage claims and security area.\n\nState of planes: American will operate exclusively in the terminal, freeing up gates at Terminal E for other domestic airlines.\n\nWhat they're saying: \"I've always called Terminal D the crown jewel of DFW Airport. When Terminal F opens, it's going to take that forward,\" Donohue said.\n\nBetween the lines: Construction in the terminals, on bridges and along International Parkway can snarl traffic near the airport.\n\nWhat's next: The first phase of Terminal F is scheduled to open in 2027. The terminal should be fully operational by 2030.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "source_url": "https://www.axios.com/local/dallas/2025/05/01/american-airlines-dfw-airport-terminal-f",
    "url": "https://www.axios.com/local/dallas/2025/05/01/american-airlines-dfw-airport-terminal-f"
  },
  {
    "id": "75bbcb5d-0280-46ca-9627-e93d1afe4b2d",
    "title": "Dallas City Council approves $49 million City subsidy to support West End Lofts Project",
    "summary": "On December 11, the Dallas City Council unanimously approved a $49 million incentive package to support the development of the West End Lofts Project, a proposed mixed-use, mixed-income, and transit-oriented development project - click here to read more",
    "date": "2024-12-12",
    "city": "Dallas",
    "state": "TX",
    "content": "On December 11, the Dallas City Council unanimously approved a $49 million incentive package to support the development of the West End Lofts Project, a proposed mixed-use, mixed-income, and transit-oriented development project. The project will be developed on three existing parcels within the historic West End addressed as 805 Elm Street, 711 Elm Street, and 211 N. Austin Street within and adjacent to the City Center tax increment financing (TIF) district. The proposed project, led by Sycamore Strategies, LLC, is directly south of the West End DART light rail station and directly north of El Centro (Dallas College). “This is an exciting project that will convert underutilized/vacant historic buildings and surface parking lots into active residential and commercial uses abutting the West End DART light rail station and across the street from El Centro College,” said City Councilmember Paul Ridley (District 14), a member of the City Council’s Economic Development Committee. Council Member Ridley added, “With the reconstruction and expansion of the Kay Bailey Hutchison Convention Center and impactful projects such as West End Lofts, we can expect to see significant positive changes to the west side of downtown Dallas over the next several years.” The estimated $103.2 million project will include 154 mixed-income apartments comprised of 56 efficiencies, 25 one-bedroom, 69 two-bedroom, and 4 three-bedroom units to be constructed within the historic 805 Elm Street building and in a new 6-story building to be constructed on the existing adjacent surface parking lot. Of the 154 apartments, 63 (41%) will be income-restricted and leased solely to households earning at or below 30%, 60%, 70%, and 80% area family median income. Additionally, the project will include the development of residential amenities, rehabilitation of approximately 26,462 gross square feet of ground floor retail/commercial space, creation of an approximately 25,751 square foot plaza and promenade (open space), and rehabilitation of approximately 140 parking spaces in the historic 711 Elm Street parking garage. The project’s funding includes $54,224,085 in non-City sources, including equity in the form of low income housing tax credits and historic rehabilitation tax credits. The City’s incentive package includes an amount not to exceed $28,275,676 in City Center TIF District funding as well as up to $20,724,324 from other economic development funding sources administered by the City’s Office of Economic Development, including general obligation bond proceeds from the economic development/housing propositions in the City’s 2012 and 2024 bond programs.  \"The West End Lofts development is about more than apartments to us. It is a chance to revitalize and transform an area of downtown with a brand new pedestrian plaza, street-level retail, workforce housing and the preservation of two pieces of Dallas history,\" said Zachary Krochtengel of Sycamore Strategies. \"The City of Dallas has been an essential and invaluable partner to us, and we are extremely grateful for their support.\"“The City’s dedication to working with the West End Lofts Project development team is a prime example of how public-private partnerships can bring meaningful development to areas in need of an economic development boost,” said Kimberly Bizor Tolbert, Interim City Manager for the City of Dallas. “This important project will provide much needed affordable housing and ground floor activation within downtown’s West End Historic District. Prior to City Council consideration of the City subsidy for the project, the City Center TIF District Board of Directors unanimously recommended the use of City Center TIF District funding for this project, with the added condition that best efforts be made to provide a minimum of two square feet per residential unit for pet relief facilities. It is exciting to think of adding housing stock that will be occupied with individuals, families, and their pets, helping to grow the live-work-play spirit of downtown Dallas.”",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1089",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1089"
  },
  {
    "id": "8d38248d-1a27-4a93-9f59-80c910ae3e97",
    "title": "Dallas Supports $8 M Grant for the Historic Forest Theater",
    "summary": "On November 13,  the Dallas City Council unanimously approved an $8 million community development grant to support Forest Forward’s redevelopment of the historic Forest Theater, a key cultural and physical asset that has been closed since 2008 - click here to read more",
    "date": "2024-11-14",
    "city": "Dallas",
    "state": "TX",
    "content": "On November 13,  the Dallas City Council unanimously approved an $8 million community development grant to support Forest Forward’s redevelopment of the historic Forest Theater, a key cultural and physical asset that has been closed since 2008.  Located at 1918 Martin Luther King Jr. Boulevard in South Dallas’s Forest District, the theater is the focal point of a revitalization project estimated to cost $81 million. Forest Forward has already invested over $15 million in selective demolition and environmental remediation efforts.“This project is revitalizing a cherished community asset, and its significance extends far beyond the theater itself,” said Deputy Mayor Pro Tem Adam Bazaldua (District 7), a member of the City Council’s Economic Development Committee. “While the physical restoration of the Forest Theater is vital, the real value lies in the community collaboration and the lasting positive impact this project will have for generations to come.”The project includes:Comprehensive rehabilitation of the 35,630-square-foot, 75-year-old Forest Theater, in accordance with the Secretary of the Interior’s Standards for Rehabilitation. This will include the 500-seat main theater and lobby;New construction of an approximately 28,000-square-foot building addition to provide more lobby space and a 175-seat black box theater;Additional improvements, such as a café, rooftop deck, lawn for special events, and streetscape enhancements on Harwood Street to support public events and festivals.Upon completion, the redeveloped Forest Theater facility is expected to host more than 140 events annually.“With the support of the City of Dallas, the iconic Forest Theater will shine again in South Dallas. Not only will this investment bring the theater back to life, but it will create jobs, provide vital cultural space for the community, and deliver significant economic benefits,” said Elizabeth Wattley, President and CEO of Forest Forward. “We are grateful for the dedication of the City’s Office of Economic Development and for the continued support of Deputy Mayor Pro Tem Adam Bazaldua.”Forest Forward, a non-profit organization founded in 2020, was created specifically to revitalize the Forest Theater and works closely with the South Dallas community to drive equitable development, economic mobility, and improved outcomes for children, residents, and families. Forest Forward acquired the Forest Theater property in 2021.The City’s $8 million community development grant will include $7 million from the City’s Infrastructure Investment Fund, a funding source established in 2023 to make targeted infrastructure investments in Economic Development Target Areas. The Infrastructure Investment Fund and the Community Development Program are part of new initiatives introduced last year under the City Council’s updated Economic Development and Incentive Policies, designed to address economic disparities and outcomes in historically underserved communities through strategic policy, public investment, and partnership.“Supporting a project like the Forest Theater is a prime example of why the City of Dallas updated its Economic Development Incentive Policy last year,” said Kimberly Bizor Tolbert, Interim City Manager for the City of Dallas. “Providing this funding to a valued non-profit partner like Forest Forward to support the revitalization of the Forest Theater aligns perfectly with the goals of our Office of Economic Development’s Community Development Program, and I’m thrilled that this project will be the first to benefit from our Infrastructure Investment Fund.”",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1086",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1086"
  }
]