[
  {
    "id": "77c224ff-517e-4b02-9c0f-db0bccc88470",
    "title": "See all",
    "summary": "Carly Mallenbaum\nMar 14, 2025\n-\nAxios Dallas\nWhat's next for Bam's Vegan after store closing\n\nPhoto illustration: Axios Visuals - click here to read more",
    "date": "2025-05-07",
    "city": "Dallas",
    "state": "TX",
    "content": "Carly Mallenbaum\nMar 14, 2025\n-\nAxios Dallas\nWhat's next for Bam's Vegan after store closing\n\nPhoto illustration: Axios Visuals. Photo: Natalie Waller",
    "source_url": "https://www.axios.com/local/dallas/business-brief",
    "url": "https://www.axios.com/local/dallas/business-brief"
  },
  {
    "id": "8633e146-1f44-48fd-8285-68cb1148f205",
    "title": "Real ID air travel requirement finally here",
    "summary": "Look for the star on your ID - click here to read more",
    "date": "2025-05-06",
    "city": "Dallas",
    "state": "TX",
    "content": "Look for the star on your ID. Illustration: Brendan Lynch/Axios\n\nStarting Wednesday, U.S. airports will require travelers to present a Real ID at TSA checkpoints, military bases and secure federal buildings.\n\nThe big picture: Real IDs are forms of identification that are validated using federal documents, such as passports.\n\nFlashback: President George W. Bush signed the Real ID law in 2005, in response to the 9/11 terrorist attacks.\n\nHow it works: All domestic travelers will have to present a Real ID, their passport or a permanent resident card. The TSA website notes other acceptable forms of identification.\n\nReality check: You don't need a Real ID to drive, vote or open a bank account.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "source_url": "https://www.axios.com/local/dallas/2025/05/06/real-id-texas",
    "url": "https://www.axios.com/local/dallas/2025/05/06/real-id-texas"
  },
  {
    "id": "a9ee5638-8d03-40f2-a56b-a56c93d86b5c",
    "title": "Dallas-Fort Worth under flood watch Tuesday",
    "summary": "Hot take: We love rain - click here to read more",
    "date": "2025-05-05",
    "city": "Dallas",
    "state": "TX",
    "content": "Hot take: We love rain. Photo: Naheed Rajwani-Dharsi/Axios\n\nOur stormy days aren't over yet. A flood watch is in effect across Dallas-Fort Worth on Tuesday, with more rain chances through Friday.\n\nWhy it matters: April's rain eased the abnormally dry conditions in the northern parts of Texas, but parts of South and West Texas remain in drought.\n\nThreat level: The flood watch extends from Bryan to Wichita Falls.\n\nBetween the lines: Rainfall from the past few weeks has filled North Texas lakes, adding to the flood risk.\n\nBy the numbers: DFW Airport received 14.6 inches of rain between Jan. 1 and May 4, per the National Weather Service. That's around 2 inches above the average rainfall for the same period.\n\nFlashback: It's been a decade since North Texas set a record for the most rainfall in a year.\n\nWhat to do: Maintain a longer distance between cars, don't drive through standing water and be extra careful on low-lying roads.\n\nWhat's next: Rain chances continue this week but will hover below 40% after Tuesday. Highs are forecast to remain below 80.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "source_url": "https://www.axios.com/local/dallas/2025/05/05/dallas-fort-worth-flood-watch",
    "url": "https://www.axios.com/local/dallas/2025/05/05/dallas-fort-worth-flood-watch"
  },
  {
    "id": "56f7c71b-99d6-49c8-bdfb-5b1cff5830f6",
    "title": "Why Dallas-Fort Worth embraces the sprawl",
    "summary": "Dallas-Fort Worth keeps growing and spreading - click here to read more",
    "date": "2025-05-01",
    "city": "Dallas",
    "state": "TX",
    "content": "Dallas-Fort Worth keeps growing and spreading. Photo: Jay L. Clendenin/Getty Images\n\nNorth Texas housing could be even more expensive if not for new development in the sprawling suburbs, according to a new George W. Bush Institute report.\n\nWhy it matters: People want to move to Texas and specifically to the Dallas-Fort Worth region.\n\nThe latest: Dallas-Fort Worth and other Sun Belt metro areas offer more affordable houses and apartments than equally in-demand coastal cities, like San Francisco, because they have less-restrictive housing policies, the Bush Institute report found.\n\nStunning stat: If every large U.S. metro had similar housing policies to D-FW and other Sun Belt regions, about 5.6 million additional homes would have been built nationwide from 2010 to 2023.\n\nWhat they did: Economists with the nonpartisan independent policy institute at SMU analyzed population, income and real estate data from the 250 largest metro areas since 2010 to determine how cities are meeting the demand for housing.\n\nWhat they found: The U.S. population has shifted from the coasts and the northeast to Sun Belt cities in the South and mountain metros in the West.\n\nReality check: Though Sun Belt metros have more affordable real estate than restrictive coastal cities, housing in the Sun Belt still remains too expensive for people at the lowest income levels.\n\nZoom out: Charlotte, N.C., ranked as the No. 1 most pro-growth metro in the country due to how quickly the city has added housing to match its population growth.\n\nZoom in: Dallas-Fort Worth accounted for 5.1% of new housing production in the largest 250 U.S. metros from 2010-2023, per the report.\n\nBetween the lines: The housing growth hasn't come from increasing density in the core cities, like Dallas and Fort Worth. Most new housing has been added in suburbs and exurbs.\n\nWhat they're saying: Suburbs like Frisco and McKinney are successful because they allow mixed-use development, single-family housing and multifamily housing, which makes them more dense than suburbs outside of cities like Boston.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "source_url": "https://www.axios.com/local/dallas/2025/05/01/dallas-fort-worth-housing-sprawl",
    "url": "https://www.axios.com/local/dallas/2025/05/01/dallas-fort-worth-housing-sprawl"
  },
  {
    "id": "aa83b5f4-a5b0-4054-9d99-beb03638a239",
    "title": "American Airlines, DFW Airport plan $4B terminal",
    "summary": "Terminal F is going to be fancy - click here to read more",
    "date": "2025-05-01",
    "city": "Dallas",
    "state": "TX",
    "content": "Terminal F is going to be fancy. Rendering: Courtesy of DFW Airport\n\nDFW Airport's sixth terminal will be almost double its originally planned size and will have only American Airlines flights, the airport announced Thursday.\n\nWhy it matters: The airport, almost midway between Dallas and Fort Worth, has been critical to the population and business growth of the region.\n\nThe big picture: DFW Airport was the world's third-busiest airport last year, following Atlanta and Dubai.\n\nThe latest: The Fort Worth-based airline plans to spend $4 billion on the terminal, which will have 31 gates and its own parking, baggage claims and security area.\n\nState of planes: American will operate exclusively in the terminal, freeing up gates at Terminal E for other domestic airlines.\n\nWhat they're saying: \"I've always called Terminal D the crown jewel of DFW Airport. When Terminal F opens, it's going to take that forward,\" Donohue said.\n\nBetween the lines: Construction in the terminals, on bridges and along International Parkway can snarl traffic near the airport.\n\nWhat's next: The first phase of Terminal F is scheduled to open in 2027. The terminal should be fully operational by 2030.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "source_url": "https://www.axios.com/local/dallas/2025/05/01/american-airlines-dfw-airport-terminal-f",
    "url": "https://www.axios.com/local/dallas/2025/05/01/american-airlines-dfw-airport-terminal-f"
  },
  {
    "id": "e40d6111-9bfd-4cfb-b3ea-8101aee03d2f",
    "title": "What's on the May 3 ballot in Dallas-Fort Worth",
    "summary": "Illustration: Sarah Grillo/Axios\n\nElection day is Saturday, and city council and school board positions are up for grabs across North Texas.\n\nWhy it matters: Local elections determine who makes decisions about taxes, schools, land use, roads, parks and libraries.\n\nState of polls: Saturday's election includes mayoral races in Fort Worth, Plano and McKinney - click here to read more",
    "date": "2025-04-30",
    "city": "Dallas",
    "state": "TX",
    "content": "Illustration: Sarah Grillo/Axios\n\nElection day is Saturday, and city council and school board positions are up for grabs across North Texas.\n\nWhy it matters: Local elections determine who makes decisions about taxes, schools, land use, roads, parks and libraries.\n\nState of polls: Saturday's election includes mayoral races in Fort Worth, Plano and McKinney. Dallas will have at least four new City Council members after the election.\n\nBetween the lines: Conservative Christians have poured money into school board and city council races in recent years.\n\nMeanwhile: State lawmakers will decide if Dallas can move future municipal elections from May to November.\n\nBy the numbers: Dallas County has 1.4 million registered voters. Tarrant County has almost 1.3 million, Collin County has around 738,000 and Denton County has nearly 649,000.\n\nIf you go: Voting is 7am-7pm Saturday. Visit your county's election website or the Texas secretary of state's website to check your polling location.\n\nGet more local stories in your inbox with Axios Dallas.\n\nGet a free daily digest of the most important news in your backyard with Axios Dallas.\n\nSupport local journalism by becoming a member.",
    "source_url": "https://www.axios.com/local/dallas/2025/04/30/dallas-fort-worth-may-election",
    "url": "https://www.axios.com/local/dallas/2025/04/30/dallas-fort-worth-may-election"
  },
  {
    "id": "2216d9c7-a624-461d-b40b-c26763e6c1e1",
    "title": "Construction contract approved for the Trinity Strand Trail Hi Line Span Project",
    "summary": "On February 12, 2025, the Dallas City Council approved an $8 - click here to read more",
    "date": "2025-02-27",
    "city": "Dallas",
    "state": "TX",
    "content": "On February 12, 2025, the Dallas City Council approved an $8.8 million construction contract to support the Trinity Strand Trail Hi-Line Span Project. The trail infrastructure project includes a new pedestrian bridge at the end of Hi Line Drive in the Design District, and will connect the Circuit Trail and the Katy Trail to the Trinity Strand Trail, further enhancing connectivity within the City’s trail network. A lookout plaza at the new bridge will feature a shade structure, lighting, landscaping, and a public art sculpture. The community input process for the public art component is beginning in April 2025.The Trinity Strand Trail Hi-Line Span Project began in 2019, through a collaboration with the City’s Office of Economic Development, the City’s Park and Recreation Department, Friends of the Trinity Strand Trail, the Circuit Trail Conservancy (i.e. The Loop), and Dallas County. Funding for the bridge and other improvements is sourced from the Design District TIF District and completion is anticipated for Spring 2026.",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1091",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1091"
  },
  {
    "id": "f48b39f0-708a-4f27-a8be-093c084aea9d",
    "title": "City Council approves a $500,000 economic development incentive to support HAECO Global expansion",
    "summary": "On December 11, 2024, the Dallas City Council unanimously approved a maximum $500,000 economic development incentive for HAECO Global Engine Support, LLC (HAECO Global) to establish a new aviation engine repair facility at 11124 Goodnight Lane - click here to read more",
    "date": "2024-12-12",
    "city": "Dallas",
    "state": "TX",
    "content": "On December 11, 2024, the Dallas City Council unanimously approved a maximum $500,000 economic development incentive for HAECO Global Engine Support, LLC (HAECO Global) to establish a new aviation engine repair facility at 11124 Goodnight Lane. The project, with an estimated cost of $17.5 million, is expected to create or retain 170 jobs in Dallas. “This project is bringing new, high-paying and high-skill aviation repair jobs into Dallas,” said Councilmember Omar Narvaez (District 6), a member of the City Council’s Economic Development Committee. “I appreciate HAECO Global’s selection of Dallas and commitment to Dallas hiring.” HAECO Global will be leasing and occupying a 290,000 square foot newly built facility for the new engine support unit, which will be the primary location in North America for what is known as “engine hospital” repair work.   The work includes repair work for aircraft on the ground, larger repairs that may involve splitting engines into large components so they can be moved, or repair of internal components inside the engine that are then tested and reinstalled on the aircraft. HAECO Global will relocate 76 existing full-time jobs to the new Dallas facility from Carrollton and create an additional 94 jobs, for a total minimum job count of 170.  “We are thrilled to be partnering with the City of Dallas in this exciting venture,” said James Clarke, Executive Vice President of HAECO Global Engine Support. “This new location represents a tremendous opportunity for growth, both for our company and for the local community. It will bring high-quality jobs and support the development of cutting-edge technology that will shape the future of aviation.  Working with the leadership of the City’s business development group within the Office of Economic Development has been an extremely positive experience.” The City of Dallas will provide an economic development incentive grant of $500,000 if HAECO Global hires a workforce for the newly created jobs that consists of a minimum of 35% Dallas residents. If the local hiring is at least 25% Dallas residents, the grant will be $350,000. The 170 jobs must be created by December 31, 2027. Additionally, HAECO Global will participate in a workforce partnership program to help build a pipeline of skilled workers for these jobs.  “This project is a true win-win for our community,” said Kimberly Bizor Tolbert, Interim City Manager for the City of Dallas. “HAECO Global will provide high-skill and high paying jobs in Dallas, and by participating in a workforce partnership program, we are building a pipeline of Dallas workers for Dallas jobs.”",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1090",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1090"
  },
  {
    "id": "75bbcb5d-0280-46ca-9627-e93d1afe4b2d",
    "title": "Dallas City Council approves $49 million City subsidy to support West End Lofts Project",
    "summary": "On December 11, the Dallas City Council unanimously approved a $49 million incentive package to support the development of the West End Lofts Project, a proposed mixed-use, mixed-income, and transit-oriented development project - click here to read more",
    "date": "2024-12-12",
    "city": "Dallas",
    "state": "TX",
    "content": "On December 11, the Dallas City Council unanimously approved a $49 million incentive package to support the development of the West End Lofts Project, a proposed mixed-use, mixed-income, and transit-oriented development project. The project will be developed on three existing parcels within the historic West End addressed as 805 Elm Street, 711 Elm Street, and 211 N. Austin Street within and adjacent to the City Center tax increment financing (TIF) district. The proposed project, led by Sycamore Strategies, LLC, is directly south of the West End DART light rail station and directly north of El Centro (Dallas College). “This is an exciting project that will convert underutilized/vacant historic buildings and surface parking lots into active residential and commercial uses abutting the West End DART light rail station and across the street from El Centro College,” said City Councilmember Paul Ridley (District 14), a member of the City Council’s Economic Development Committee. Council Member Ridley added, “With the reconstruction and expansion of the Kay Bailey Hutchison Convention Center and impactful projects such as West End Lofts, we can expect to see significant positive changes to the west side of downtown Dallas over the next several years.” The estimated $103.2 million project will include 154 mixed-income apartments comprised of 56 efficiencies, 25 one-bedroom, 69 two-bedroom, and 4 three-bedroom units to be constructed within the historic 805 Elm Street building and in a new 6-story building to be constructed on the existing adjacent surface parking lot. Of the 154 apartments, 63 (41%) will be income-restricted and leased solely to households earning at or below 30%, 60%, 70%, and 80% area family median income. Additionally, the project will include the development of residential amenities, rehabilitation of approximately 26,462 gross square feet of ground floor retail/commercial space, creation of an approximately 25,751 square foot plaza and promenade (open space), and rehabilitation of approximately 140 parking spaces in the historic 711 Elm Street parking garage. The project’s funding includes $54,224,085 in non-City sources, including equity in the form of low income housing tax credits and historic rehabilitation tax credits. The City’s incentive package includes an amount not to exceed $28,275,676 in City Center TIF District funding as well as up to $20,724,324 from other economic development funding sources administered by the City’s Office of Economic Development, including general obligation bond proceeds from the economic development/housing propositions in the City’s 2012 and 2024 bond programs.  \"The West End Lofts development is about more than apartments to us. It is a chance to revitalize and transform an area of downtown with a brand new pedestrian plaza, street-level retail, workforce housing and the preservation of two pieces of Dallas history,\" said Zachary Krochtengel of Sycamore Strategies. \"The City of Dallas has been an essential and invaluable partner to us, and we are extremely grateful for their support.\"“The City’s dedication to working with the West End Lofts Project development team is a prime example of how public-private partnerships can bring meaningful development to areas in need of an economic development boost,” said Kimberly Bizor Tolbert, Interim City Manager for the City of Dallas. “This important project will provide much needed affordable housing and ground floor activation within downtown’s West End Historic District. Prior to City Council consideration of the City subsidy for the project, the City Center TIF District Board of Directors unanimously recommended the use of City Center TIF District funding for this project, with the added condition that best efforts be made to provide a minimum of two square feet per residential unit for pet relief facilities. It is exciting to think of adding housing stock that will be occupied with individuals, families, and their pets, helping to grow the live-work-play spirit of downtown Dallas.”",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1089",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1089"
  },
  {
    "id": "a6d43135-0d66-4c19-a2db-549600bc7975",
    "title": "Kerwin Medical Center Expands in Oak Cliff",
    "summary": "Kerwin Medical Center- Oak CliffThe Office of Economic Development congratulates Kerwin Medical Center (KMC) on expanding its medical practice by adding a second location in Oak Cliff - click here to read more",
    "date": "2024-11-25",
    "city": "Dallas",
    "state": "TX",
    "content": "Kerwin Medical Center- Oak CliffThe Office of Economic Development congratulates Kerwin Medical Center (KMC) on expanding its medical practice by adding a second location in Oak Cliff. Since 2018, KMC has provided access to clinical research trials for Alzheimer's and other dementias and will expand access to the Oak Cliff community. While their main goal is to give patients investigational treatment options for memory loss, the team prides itself on connecting patients experiencing memory loss with resources in the community, even if KMC is not the right fit for the patient. The medical center is a valuable addition to the tenant mix at 4315 Innovation Center (a redevelopment project of the former Dallas-Area Urban League building) supported by the City of Dallas. On May 22, 2019, the Dallas City Council, through the City's Public-Private Partnership Program, approved a $750,000 economic development grant to E. Smith Communities LLC to support the building rehabilitation at 4315 South Lancaster Road (known now as 4315 Innovation Center). Revitalization of the previous vacant and poorly maintained building included various interior, exterior, and streetscape improvements including but not limited to mechanical systems, upgraded electrical wiring, upgraded restrooms for ADA compliance, complete roof replacement, sidewalk, parking, and landscaping. E. Smith Communities completed the project on December 16, 2020, and the public-private partnership investment has strengthened the economic and social fabric within the Lancaster Corridor.    KMC's private investment demonstrates additional commitment to not only providing the highest level of patient care in the community but signals further development. \"KMC is very proud of the Oak Cliff site and very excited to be a physical part of the community,\" said Dr. Diana Kerwin. ***in the photo (L to R): Samuel Harvey, Oak Cliff Chamber of Commerce; Tamela Thornton, E. Smith Legacy Holdings, LLC; Dr. Diana Kerwin, Kerwin Medical Center; and Priscilla Chambliss, City of Dallas – Office of Mayor Pro Tem Tennell Atkins",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1088",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1088"
  },
  {
    "id": "7b6fc3ca-7440-4c8b-be22-1e2e8ceff683",
    "title": "Dallas Council Supports Financing Package for Malcolm's Point Retail Center",
    "summary": "On November 13, the Dallas City Council unanimously approved a $1 - click here to read more",
    "date": "2024-11-14",
    "city": "Dallas",
    "state": "TX",
    "content": "On November 13, the Dallas City Council unanimously approved a $1.5 million incentive package to support the development of the Malcolm’s Point Retail Center, a project led by SouthFair Community Development Corporation (CDC) at the corner of Al Lipscomb Way and S. Malcolm X Boulevard.“This is another important step forward for South Dallas,” said Deputy Mayor Pro Tem Adam Bazaldua (District 7), a member of the City Council’s Economic Development Committee. “This project not only brings much-desired retail options to the area but also provides new opportunities for small businesses and serves as a true example of impactful economic development.”The $2.3 million project includes a new 4,800-square-foot building that will house the SouthFair CDC offices as well as Aunt Irene’s Kitchen. The project will bring much-needed retail, restaurant, office, and community space to South Dallas, with neighborhood-based small businesses also expected to co-locate in the SouthFair CDC office space.“Our Malcolm’s Point Retail Project has been a long labor of love,” said Annie Evans, Executive Director of SouthFair CDC. “On behalf of our Board of Directors, we are thrilled to celebrate this significant milestone with Deputy Pro Tem Bazaldua, the City of Dallas, our lending partners, and our project team. This achievement exemplifies the impact we can make when we work together.”Founded in 1991, SouthFair CDC is a non-profit organization dedicated to supporting housing and redevelopment in the Jeffries-Meyers neighborhood of South Dallas. Over the past 30 years, SouthFair has delivered more than $35 million in investment to the South Dallas Fair Park area.The City’s $1.5 million economic development funding includes a $1,190,354 low-interest loan from the South Dallas Fair Park Opportunity Fund and a $312,500 community development grant to provide additional gap financing. The Texas Mezzanine Fund is also participating in the financing of the project.“The Malcolm’s Point Retail Project is a prime example of how community development can drive economic growth,” said Kimberly Bizor Tolbert, Interim City Manager for the City of Dallas. “This important project was made possible by the collaboration between SouthFair CDC, the South Dallas Fair Park Opportunity Fund Advisory Board, Texas Mezzanine Fund, and the City’s Office of Economic Development.”The South Dallas Fair Park Opportunity Fund is a place-based funding program created in 1989 to support economic and human development specifically in the neighborhoods surrounding Fair Park. The City’s Community Development Program, launched as part of last year’s updated Economic Development Policy and Incentive Policy, is one of several new tools designed to drive progress in underserved communities.“The South Dallas Fair Park Opportunity Fund Board is honored to support this landmark project for our community,” said Leander Johnson, Chairman of the South Dallas Fair Park Opportunity Fund Board of Directors. “With adaptable funding and meaningful partnerships, the Opportunity Fund is uniquely positioned to foster growth in South Dallas. We believe Malcolm’s Point is just the beginning, paving the way for continued opportunities that will uplift our neighborhoods and empower local businesses.”",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1087",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1087"
  },
  {
    "id": "8d38248d-1a27-4a93-9f59-80c910ae3e97",
    "title": "Dallas Supports $8 M Grant for the Historic Forest Theater",
    "summary": "On November 13,  the Dallas City Council unanimously approved an $8 million community development grant to support Forest Forward’s redevelopment of the historic Forest Theater, a key cultural and physical asset that has been closed since 2008 - click here to read more",
    "date": "2024-11-14",
    "city": "Dallas",
    "state": "TX",
    "content": "On November 13,  the Dallas City Council unanimously approved an $8 million community development grant to support Forest Forward’s redevelopment of the historic Forest Theater, a key cultural and physical asset that has been closed since 2008.  Located at 1918 Martin Luther King Jr. Boulevard in South Dallas’s Forest District, the theater is the focal point of a revitalization project estimated to cost $81 million. Forest Forward has already invested over $15 million in selective demolition and environmental remediation efforts.“This project is revitalizing a cherished community asset, and its significance extends far beyond the theater itself,” said Deputy Mayor Pro Tem Adam Bazaldua (District 7), a member of the City Council’s Economic Development Committee. “While the physical restoration of the Forest Theater is vital, the real value lies in the community collaboration and the lasting positive impact this project will have for generations to come.”The project includes:Comprehensive rehabilitation of the 35,630-square-foot, 75-year-old Forest Theater, in accordance with the Secretary of the Interior’s Standards for Rehabilitation. This will include the 500-seat main theater and lobby;New construction of an approximately 28,000-square-foot building addition to provide more lobby space and a 175-seat black box theater;Additional improvements, such as a café, rooftop deck, lawn for special events, and streetscape enhancements on Harwood Street to support public events and festivals.Upon completion, the redeveloped Forest Theater facility is expected to host more than 140 events annually.“With the support of the City of Dallas, the iconic Forest Theater will shine again in South Dallas. Not only will this investment bring the theater back to life, but it will create jobs, provide vital cultural space for the community, and deliver significant economic benefits,” said Elizabeth Wattley, President and CEO of Forest Forward. “We are grateful for the dedication of the City’s Office of Economic Development and for the continued support of Deputy Mayor Pro Tem Adam Bazaldua.”Forest Forward, a non-profit organization founded in 2020, was created specifically to revitalize the Forest Theater and works closely with the South Dallas community to drive equitable development, economic mobility, and improved outcomes for children, residents, and families. Forest Forward acquired the Forest Theater property in 2021.The City’s $8 million community development grant will include $7 million from the City’s Infrastructure Investment Fund, a funding source established in 2023 to make targeted infrastructure investments in Economic Development Target Areas. The Infrastructure Investment Fund and the Community Development Program are part of new initiatives introduced last year under the City Council’s updated Economic Development and Incentive Policies, designed to address economic disparities and outcomes in historically underserved communities through strategic policy, public investment, and partnership.“Supporting a project like the Forest Theater is a prime example of why the City of Dallas updated its Economic Development Incentive Policy last year,” said Kimberly Bizor Tolbert, Interim City Manager for the City of Dallas. “Providing this funding to a valued non-profit partner like Forest Forward to support the revitalization of the Forest Theater aligns perfectly with the goals of our Office of Economic Development’s Community Development Program, and I’m thrilled that this project will be the first to benefit from our Infrastructure Investment Fund.”",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1086",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1086"
  },
  {
    "id": "b4ea2c64-9a20-4b23-8825-f43824ba2bf4",
    "title": "Cabana Design District Celebrates Groundbreaking",
    "summary": "Cabana Design District, a mixed-income housing development at 899 North Stemmons Freeway in the Design District, celebrated a groundbreaking on October 29th - click here to read more",
    "date": "2024-10-30",
    "city": "Dallas",
    "state": "TX",
    "content": "Cabana Design District, a mixed-income housing development at 899 North Stemmons Freeway in the Design District, celebrated a groundbreaking on October 29th.  It will be a transformational historic rehabilitation and adaptive reuse of the former Cabana Hotel in the southern part of the Design District.The development will provide 175 multi-family units of which 40% or 70 units will be affordable at a range of income bands from 30% to 80% area median family income (AMFI) for 45 years. The total project cost is over $116 million and is supported by a City of Dallas subsidy of up to $41 million from the Design District Tax Increment Financing (TIF) District, approved by City Council in September 2023 (which includes funds for environmental remediation, public infrastructure improvements, and an economic development grant) as well as federal housing tax credits from the Texas Department of Housing & Community Affairs and federal/state historic tax credits.Sycamore Development, in partnership with Hunt Capital Partners, is the developer. The building has been vacant for more than 10 years and is on the National Register of Historic Places.The property was originally developed in 1962 as the Cabana Motor Court Hotel by Las Vegas hotelier Jay Sarno, and, in its heyday, was visited by celebrities like The Beatles and Led Zeppelin. A young Raquel Welch worked as a cocktail waitress in the “Bon Vivant Room.” Many of the historic features will be brought back to life in this catalyst project that will provide much needed affordable housing near high opportunity areas.",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1084",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1084"
  },
  {
    "id": "52337f87-c6a8-481a-bfa0-9d399df4d2ab",
    "title": "Office of Economic Devleopment Receives IEDC Awards",
    "summary": "The City of Dallas Office of Economic Development received two 2024 Excellence in Economic Development Silver Awards from the International Economic Development Council (IEDC) - click here to read more",
    "date": "2024-10-30",
    "city": "Dallas",
    "state": "TX",
    "content": "The City of Dallas Office of Economic Development received two 2024 Excellence in Economic Development Silver Awards from the International Economic Development Council (IEDC). The awards were bestowed specifically for the organization’s work in the Economic Equity & Inclusion category and the Neighborhood Development category that impacted a population greater than 500,000 residents. \"The City of Dallas Office of Economic Development is setting the standard of excellence for economic development with its Oak Lawn Place project and the City of Dallas Tax Reinvestment Zone #6 (Farmers Market TIF District). These awards highlight the City of Dallas’ commitment to its community and demonstrates the transformative impact of economic development,” said Nathan Ohle, IEDC President and CEO, “It is with great pride that IEDC presents these awards to the City of Dallas, celebrating their leadership and innovation in the field of economic development.\"“We are absolutely thrilled to announce this year's award winners. These exceptional projects showcase remarkable dedication and ingenuity within the field,\" said Kevin Kramer, Chair of IEDC’s Excellence in Economic Development Awards Advisory Committee. “The City of Dallas Office of Economic Development’s contributions will leave a lasting impact and demonstrate its commitment to creating positive change for its residents.”Every year IEDC looks specifically for economic development organizations, government entities, initiatives, and programs that have demonstrated consistent, exemplary performance in the economic development profession, leading the execution of projects that have a significant impact on revitalizing communities, and playing a major role in shaping and improving the practice of economic development.About the Projects:In the category of Economic Equity & Inclusion, the Office of Economic Development received a Silver Award for its role in helping to facilitate the Oak Lawn Place Project, a senior affordable multi-family development at 5723 Sadler Circle in the Maple/Mockingbird TIF District. Oak Lawn place opened its doors on July 15th and expects to reach full occupancy this fall.   Visit the Resource Center for more information. In the category of Neighborhood Development, the Office of Economic Development received a Silver Award for its role in management and implementation of City of Dallas Tax Reinvestment Zone #6 (Farmers Market TIF District) since its creation in 1998. Visit the Farmers Market TIF District for more information.  About the International Development Council: The International Economic Development Council (IEDC) is a non-profit, non-partisan membership organization serving economic developers. With more than 4,300 members, IEDC is the largest organization of its kind. Economic developers promote economic well-being and quality of life for their communities by creating, retaining, and expanding jobs that facilitate growth, enhance wealth, and provide a stable tax base. From public to private, rural to urban, and local to international, IEDC’s members engage in the full range of economic development practices. Given the breadth of economic development work, our members are employed in various settings, including local, state, provincial, and federal governments, public-private partnerships, chambers of commerce, universities, and a variety of other institutions. When IEDC succeeds, its members create high-quality jobs, develop vibrant communities, and improve the quality of life in their regions. Learn more at www.iedconline.org today!",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1085",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1085"
  },
  {
    "id": "0909ed87-b795-4e90-a74f-61c6f5bc2253",
    "title": "East Dock Redevelopment Project in the East Oak Cliff Area Approved for Incentives",
    "summary": "The East Dock Redevelopment Project at 900 E - click here to read more",
    "date": "2024-10-30",
    "city": "Dallas",
    "state": "TX",
    "content": "The East Dock Redevelopment Project at 900 E. Clarendon Drive will be an adaptive reuse of the vacant 62,000 square foot former 1900s-era icehouse building into leasable commercial spaces to accommodate various tenants, including office, personal service, showroom, and retail/restaurant. The development is within walking distance of the DART Dallas Zoo light rail station, Dallas Zoo, and Southern Gateway Deck Park, now Halperin Park (under construction). The total project cost is approximately $10.6 million. Support for the project includes a City of Dallas incentive of up to $2,681,864 approved by City Council on October 23rd sourced from the Oak Cliff Gateway Tax Increment Financing (TIF) District. The is the first development project in the new Clarendon/Beckley/Kiest Sub-District after an expansion of the Oak Cliff Gateway TIF District east of IH-35 in 2022. The Owner/Developer, Proxy Properties, has over a decade of experience completing adaptive reuse projects in the southern sector of Dallas.",
    "source_url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1083",
    "url": "https://www.dallasecodev.org/CivicAlerts.aspx?AID=1083"
  }
]