{
  "title": "German medical device company establishes U.S. headquarters in Tampa",
  "content": "ity has leased 1,600 square feet and plans to create 12 new jobs over the next three years in roles such as technical and software engineering, business development and marketing.The new office is situated in the heart of Tampa’s downtown at 1000 N. Ashley Dr. and within the Tampa Medical & Research District (TMRD). Medabil International assisted with the real estate search and brokered the transaction.This project was made possible in partnership with the Tampa Bay Economic Development Council and Select Florida. Joanne LeBlanc with Colliers is a leader in the life sciences industry, particularly in the medical device manufacturing sector where it currently ranks second. In Tampa Bay, nearly 1,100 life sciences companies are located here, supporting more than 25,000 jobs. Over the next five years, the health care and life sciences industry is projected to see a growth rate of more than 6% in the Tampa MSA. Additionally, more than 20% of those employed in the life sciences sector in Florida reside in the Tampa MSA.Florida chnology innovations.Tampa is also home to the Tampa Medical and Research District (TMRD), a burgeoning hub of world-class clinical care, academics, research and biotechnology, anchored by Tampa General Hospital and the USF Health Morsani College of Medicine, and in partnership with the Tampa Bay Economic Development Council. USF CAMLS, also located within the TMRD, is a center of excellence for medical learning and simulation. Medability’s choice of Tampa for their U.S. headquarters further solidifies Tampa as a destination for medical training and te is expanding into the U.S. market with its groundbreaking medical devices. For more information, visit https://medability.de.As part of its commitment to innovation and growth, Medability information, visit www.tampabayedc.com.The Tampa Bay Economic Development Council is the lead designated economic development agency for Hillsborough County and the cities of Tampa, Plant City and Temple Terrace. Established in 2009 as a partnership between the public sector and private corporate investors, the EDC works to advance a diversified local economy that is beneficial to all by attracting, expanding and retaining quality employers, a talented workforce and investment, focusing within targeted industry sectors, including Corporate Headquarters, Financial and Professional Services, Information Technology, Life Science and Health Care, Defense and Security, Distribution and Logistics, and Manufacturing. The EDC exists because of the generous support of more than 100 corporations, Hillsborough County, and the cities of Tampa, Plant City and Temple Terrace. For more",
  "url": "https://tampabayedc.com/news/german-medical-device-company-establishes-u-s-headquarters-in-tampa/",
  "date": "2025-01-28"
}