{
  "title": "Greater Memphis Chamber Celebrates Hyosung HICO’s $50.8 Million Expansion in Shelby County",
  "content": "MEMPHIS, TN – May 14, 2025 – The Greater Memphis Chamber proudly announces Hyosung HICO, Ltd’s significant expansion of its Memphis operations. The South Korean power transformer manufacturer will invest $50.8 million and create 123 new jobs in Shelby County, further strengthening Memphis’ position as a hub for advanced manufacturing and energy infrastructure. es the strategic advantages our region offers to global companies. With our robust infrastructure, skilled workforce, and business-friendly environment, Memphis continues to attract significant investments that create quality jobs for our community. This expansion is another powerful example of how we’re building the Digital Delta and strengthening our economic foundation.”“This expansion by Hyosung HICO reinforces Memphis’s growing reputation as a center for advanced manufacturing excellence,” said Ted Townsend, President and CEO of the Greater Memphis Chamber. “Their decision to grow their footprint here demonstrat decade,” said Jason Neal, President of Hyosung HICO and Senior Executive VP of HICO America. “Memphis is more than a manufacturing site—it’s the foundation of Hyosung HICO’s long-term commitment to U.S. energy infrastructure and our expanding position as a leading supplier of products and solutions to the market. Acquiring the Memphis plant in 2019 remains one of the most pivotal decisions in our company’s history. This investment reaffirms our commitment to the City of Memphis, the state of Tennessee, our employees, and our utility and industrial partners across North America as we continue to deliver unmatched quality in large power transformers and enhance grid stability for all.”“Today’s expansion of our Memphis transformer facility marks a major milestone in our U.S. growth strategy and underscores our vision to become the #1 supplier of large power transformers in the country by 2027 and the leading supplier of solutions by the end of this South Korea has emerged as Tennessee’s top partner for foreign direct investment since 2019, with Korean companies investing more than $4.5 billion and creating nearly 3,500 jobs statewide.",
  "url": "https://memphismoves.com/2025/05/14/greater-memphis-chamber-celebrates-hyosung-hicos-50-8-million-expansion-in-shelby-county/",
  "date": "2025-05-15"
}