{
  "title": "Freight brokerage firm TQL expands into downtown Chattanooga office",
  "content": "97, opened its Nashville office in 2014 and employs more than 100 people at the location. The company added offices in Memphis and Knoxville in 2015, and those two locations have grown to more than 250 employees between the two sites.TQL, which is headquartered in Cincinnati, where the company was started in 19 oga community,\" TQL President Kerry Byrne said in an announcement of the new Chattanooga office. \"We chose Chattanooga for its reach as a transportation hub and its great pool of talent. We're excited to be part of such a vibrant city and build on our 10-year presence in the state.\"\"We're proud to grow our team and deepen our commitment to Tennessee in the incredible Chattano ere in Chattanooga, which is why we have called this Freight Alley,\" FreightWaves CEO Craig Fuller said in an interview last year. \"We have a high concentration of talent here in a business that encourages growth and innovation, so I think we'll continue to see a lot of growth in many of these startup businesses in logistics.\"\"I think logistics are driving our entrepreneurial and startup economy h for the software and media company FreightWaves, which was among the companies included on the Inc. 5000 list in recent years.Fuller, whose family has been involved in building such trucking giants as Southwest Motor Freight, U.S. Xpress Enterprises, Covenant Logistics and Transcard in Chattanooga, monitors and reports on the logistics industry ship team,\" Koweek said in an emailed statement. \"For now, we are focused on hiring talented Chattanoogans who can bring their community insight to TQL and become big contributors to the global supply chain.\"\"As the (Chattanooga) office grows, we look forward to eventually announcing our leader is achievement,\" TQL President Kerry Byrne said. \"Maintaining growth speaks volumes to the company we have become. This honor is a tribute to our employees, our carriers and the customers who place their trust in us.\"\"We are proud of th",
  "url": "https://edition.timesfreepress.com/article/7120905469765093",
  "date": "2024-04-13"
}