{
  "title": "Two business investment projects create 150 new jobs in Genesee County",
  "content": "Governor Gretchen Whitmer announced two business investment projects that will lead to the creation of 150 new jobs and nearly $7.8 million in capital investment in Burton, Genesee County. y chains home.” “Today, I’m excited to announce two Burton, Michigan companies are expanding their operations in our state, creating 150 good-paying jobs in Genesee County,” said Governor Whitmer. “I remain committed to making sure that anyone can make it in Michigan. That’s why I’ll work with anyone to help companies invest and grow right here in Michigan. Together, let’s keep leading the future of manufacturing by bringing jobs and suppl 73 percent growth over the past ten years. Employment in this industry is 79 percent more concentrated in Genesee County than the national average. While Michigan, and specifically, Genesee County, are traditionally known for their manufacturing heritage, over time the state’s economy has diversified its industrial base. The state’s robust talent pool of skilled tradespeople and engineers have helped facilitate that diversification, and today’s announcements show further proof of the growth of the plumbing, heating and air-conditioning industry in Genesee County. According to Lightcast, a global leader in labor market analytics, Genesee County has added over 900 jobs in this industry, equating to cross a wide range of industries. Custom Air Handling Solutions specializes in the design and manufacturing of custom-engineered air handling units (AHUs) and hydronic packages. Its HVAC systems are used for heat recovery, dehumidification, and energy recovery a c Alliance. “This decision is a testament to the strength of our region’s workforce and the resources we offer to help businesses thrive. We look forward to continuing our partnership with the company as they grow, create new job opportunities, and contribute to the economic vitality of our region.” “We are thrilled that Custom Air Handling Solutions, Inc. has chosen Flint & Genesee for their nearly $5.3 million expansion,” said Tyler Rossmaessler, executive director of the Flint & Genesee Economi enesee County, I’m always working to create a favorable job climate for our residents that brings new employment opportunities to our community,” said state Representative David Martin (R-Davison). “This upcoming investment in Burton promises to create quality local jobs and help strengthen the local economy.\" \"I'm excited to see the promised expansion of Custom Air Handling Solutions to Burton! As a constant promoter of G roots here in Genesee County, and I look forward to working together in pursuit of greater prosperity for all Michiganders.” “With over 100 new good-paying job opportunities and millions in investment anticipated, it is great to see the residents of Genesee County receive the recognition they deserve for being an incredible workforce,” said state Senator John Cherry (D-Flint). “Our area is once again cementing itself as a destination for businesses to thrive, and this latest announcement from Custom Air Handling Solutions and Fluid Cooling Systems further proves the innovation and productivity our community has to offer. Congratulations to both companies on planting and growing new th and development, ensuring a brighter future for all.\" \"We at Fluid Cooling Systems are deeply grateful to the Michigan Economic Development Corporation for their partnership in our expansion,” said Bob Antaya, President of Fluid Cooling Systems. “Their support not only fuels our innovation but also strengthens our commitment to revitalizing the Flint community. Together, we take pride in fostering grow to the dedicated workforce and local working relationships they have secured over the years. The company was considering a southern state to expand operations due to the proximity to a portion of the company’s client base, including battery production plants, but with support from the MSF, the company chose Michigan due To stay up to date on career possibilities with Fluid Cooling Systems, please click HERE.",
  "url": "https://www.michiganbusiness.org/press-releases/2025/04/business-investment-projects-genesee-county/",
  "date": "2025-04-17"
}