{
  "title": "Micron Breaks Ground on Leading-Edge Manufacturing Fab in Boise, Idaho",
  "content": "Company celebrates initiation of historic $15 billion investment; construction expected to begin early in 2023, with DRAM production slated for second half of the decade anjay Mehrotra. “With this facility, Micron will closely couple R&D and manufacturing, providing synergies that will enable us to accelerate the production ramp of advanced memory technology. The investment, made possible by the anticipated grants and credits provided by the CHIPS and Science Act, also enhances Micron’s supply chain resilience and will establish a new strategic capability for the U.S.”“We are grateful that Secretary Granholm, Dr. Nelson, Idaho elected local officials, customers, suppliers, and partners are attending today’s celebration of this historic groundbreaking in Boise,” said Micron President and CEO S industrial, automotive and mobile, fueled by adoption of artificial intelligence and 5G. The Boise manufacturing investment is part of the Micron’s strategy to increase U.S.-based DRAM production to 40% of the company’s global output in the next decade. Micron is in the final stages of its selection process for another high-volume manufacturing site in the U.S.Micron recently announced its plan to invest approximately $15 billion through the end of the decade in advanced memory manufacturing in Boise, the largest private investment ever made in Idaho. This is part of Micron’s earlier disclosed plans to invest $40 billion through the end of the decade to establish leading-edge memory manufacturing in the U.S. Although the near-term demand environment for memory and storage is challenged, memory market revenue is expected to double by 2030. New wafer production capacity will therefore be required to meet long-term demand in market segments like data center, ed to start in 2025, ramping over the second half of the decade in line with industry demand growth. Ultimately, the cleanroom space will reach 600,000 square feet — the size of approximately 10 U.S. football fields and the largest single cleanroom ever built in the country.Construction on the new fab in Boise is expected to begin in early 2023, with cleanroom space coming online in phases starting in 2025. New DRAM production is target — and we are excited to highlight the commitment of Micron and other industry partners that also recognize this promise. Micron is taking bold steps to bring communities into a realm of unlimited possibility, and we applaud its vision and action.”“With today’s groundbreaking, Micron is helping realize a key goal of the CHIPS and Science Act: investing in local communities by creating good-paying jobs in scientific and technological fields that will power America's future and increase our competitive advantage worldwide,” said Dr. Alondra Nelson, the White House Office of Science and Technology Policy Acting Director. “This project embodies the Biden-Harris Administration's vision for a prosperous, equitable nation in which all communities across the country — from rural to urban and everything in between — benefit from America's science and technology innovations. At the Office of Science and Technology Policy, we see abundant promise in the CHIPS and Science Act he opportunities this historic business expansion will bring to the citizens of our state,” said Idaho Governor Brad Little. “Micron is a true homegrown Idaho success story. In Idaho, we are proud that years of fiscal conservatism and key investments have made our state a great place to do business. We are grateful for Micron’s continued support of Idaho and our capital city, and we look forward to t their innovative products and solutions with a more geographically diverse supply chain.Locating Micron’s industry-leading DRAM production in the U.S. brings tremendous benefit for its customers, enabling them to build from operations by 2030 and net-zero emissions by 2050.In line with local and global environmental commitments, Micron aims to achieve 100% water reuse, recycling and restoration as well as use 100% renewable electricity at the new facility. Additionally, the company plans to use green infrastructure and sustainable building attributes for the construction of the new fab to attain Leadership in Energy and Environmental Design (LEED) Gold status. These efforts support Micron’s global target to achieve a 42% reduction in greenhouse gas emissions e property of Micron Technology, Inc. All other trademarks are the property of their respective owners. © 2022 Micron Technology, Inc. All rights reserved. Information, products, and/or specifications are subject to change without notice. Micron, the Micron logo, and all other Micron trademarks are th",
  "url": "https://investors.micron.com/news-releases/news-release-details/micron-breaks-ground-leading-edge-manufacturing-fab-boise-idaho",
  "date": "2022-09-12"
}