{
  "title": "Gov. Whitmer Delivers Road Ahead Address in Flint on Semiconductor Chips, Creating & Retaining Good-Paying Michigan Jobs",
  "content": "Governor advocates for landing a chip manufacturing plant, adding better tools to economic development toolkit to attract and retain good-paying, high-skill jobs have a fair shot at a good life by landing a once-in-a-generation project and doubling down on our comprehensive economic strategy that centers people.” “Right now, we have an opportunity to set Michigan up for decades of growth and success,” said Governor Whitmer. “By working together to secure a fab, help businesses bring high-skill jobs home, and reward companies that keep good jobs in Michigan, we can design and build the technology we need to lead the 21st century. Let’s build on our momentum to make sure that families in Flint and across the state “I am grateful to Gov. Gretchen Whitmer for presenting a bold, aspirational vision of securing a semiconductor fab facility by the end of 2026,” said Quentin L. Messer, Jr., CEO of the MEDC. “Alongside her and the Michigan Legislature, the Michigan Economic Development Corporation has been building Michigan’s footprint in the semiconductor industry. From welcoming investments by SK Siltron, Hemlock Semiconductors, KLA, and more, to a designated Semiconductor Talent Action Team working with Michigan universities and companies to create a talent pipeline, to supporting industry 4.0 technologies and beyond, Team Michigan is semiconductor investment ready. As more and more components of our daily lives require semiconductor chips and other advanced technologies, it is more important than ever to make these technologies in America. We have the receipts: There is no better place in America than here! Let’s Make it in Michigan!” versity understands that lasting impact is forged when mission-driven institutions work in concert with visionary public leadership,” said Kettering University President Dr. Robert K. McMahan. “The Governor focus on innovation, talent cultivation, and preparing Michigan for the future aligns directly with the heart of Kettering’s mission. Since our founding, we have stood at the crossroads of industry and innovation. This year, we’ve expanded our focus in industries of the future, announced a new Accelerated Bachelor of Science in Semiconductor Materials and Devices program, and are working on new curricula in semiconductors, hydrogen, software, and more. We believe, as Governor Whitmer does, that Michigan’s next chapter will be written where innovation drives growth and talent fuels progress. Here at Kettering, we’re proud to be such a place and look forward to defining Michigan’s next chapter.” “From economic revitalization to workforce development, Kettering Uni latest in my series of speeches about “the Road Ahead.” I want to thank Kettering University for hosting us at the GM Mobility Research Center and for all the work they do to train the next generation of builders and innovators. Today, let’s talk about the future of our economy. I wanted to focus on the future in Flint because this is a place that has the potential to be on the cutting-edge of manufacturing for decades to come. People outside of Michigan know that Detroit is the Motor City, but this is Vehicle City. GM was founded here in 1908. The UAW was strengthened here by the Sit-Downers. Flint has a rich history, but we know that it’s been left out or left behind for far too long. I want the world to hear the name Flint and think about the things that are made here and not the things that happened here. If we work together this year, Flint will be known as a place that leads, builds, and grows. Hello! Excited to be in Flint for the he products the world will need for decades to come. That includes everything from medical devices and drones to solar panels and semiconductor chips. Michigan is well positioned to lead this race, but we need to use every resource we can to win. This isn’t a partisan issue… it’s just commonsense. We can and should disagree about the details, but we have to get on the same page.Right now, there’s an ongoing race to mine the minerals, make the components, and assemble t e seen a glimpse of that bright future. By working together, we’ve secured game-changing projects to design, test, and manufacture next-generation products right here in Michigan… Over the last few years, we’v chose to build their cutting-edge facility in Michigan over Texas, Tennessee, Georgia, and both Carolinas because of our workforce, growing economy, and business-friendly environment. Beyond that, they know the values that guide their work—reliability, quality, and performance—are hallmarks of Michigan manufacturing. SK Siltron c device in the world contains Hemlock polysilicon. Think about that. This material, made by extracting crystals from quartz, goes into our phones, TVs, tablets, refrigerators, and laptops. As they like to say: “you are never more than 6 feet away from Michigan-made polysilicon.” Last year, Hemlock announced a significant expansion of their presence in Michigan, building a new, $375 million facility in Saginaw Township, creating 180 good-paying, high-skill jobs. Next, let’s talk about Hemlock Semiconductor. Founded in 1961, they are the largest producer of high-purity polysilicon in America and one of the largest in the world. Nearly every electroni p assembly plant, also known as a “fab.” So, while the SK Siltron and Hemlock projects are vital, they are ultimately suppliers in the chip manufacturing process. We have to be able to assemble the chips here too. It’s just like the auto industry. To be the best, you need suppliers and OEMs—the whole supply chain. We need a semiconductor chi n be as wide as 2 nanometers. For context, human hair is 100,000 nanometers. Human DNA is 2.5. Manufacturers go to these extreme lengths because chips are both incredibly small and incredibly difficult to manufacture. Each chip is made up of billions of transistors—tiny electronic switches—stacked on top of each other in a precise grid. These transistors ca planes to nuclear submarines to cybersecurity, relies on chips. They are crucial for AI and data centers. Let’s also consider the national security angle. The computational power we need for our defense systems, from fighter are Michiganders for jobs building or working in fabs. This includes a new, 3-year electrical engineering course geared towards semiconductor manufacturing. That’s incredible. These are jobs that Michiganders can do. Most jobs building a fab do not require a bachelor’s degree. Most permanent fab jobs, however, require a two-year degree or certificate, which a majority of working Michiganders now have. If you don’t have higher education or training yet, we’ll help you with a paid apprenticeship or a tuition-free program like Michigan Reconnect. There are so many programs right here at Kettering University that can prep we can do hard things. Getting this done will be hard, but ect, and I'm open to ideas for how to make them stronger, with more transparency, accountability, and protection for workers and taxpayers. This is about delivering a big win for Michigan, and I’ll work with legislators in both parties to get this done. Michiganders will not accept inaction. We cannot sit on our hands while other states and countries without our manufacturing advantages pass us by. No tool is going to be perf Together, we can set Michigan up for decades of success. We can write the next chapter of Flint’s story as a beacon of the future. We can honor the principles that the Sit-Downers fought for and give every working family a great shot at the good life. We can do big, hard things. Because that’s who we are. Thank you.",
  "url": "https://www.michiganbusiness.org/press-releases/2025/05/whitmer-delivers-road-ahead-address-in-flint/",
  "date": "2025-05-21"
}