{
  "title": "543 New Jobs Coming to Wayne, Bay Counties",
  "content": "Norplas Industries Inc., dba Magna Exteriors Highland Park, expands in Highland Park, to create 500 jobs HL Mechatronics to purchase two new facilities in Wiliams Township, create 43 new jobs ontinue working together to help businesses invest and grow in Michigan so every Michigander can find a good job in their hometown. I will work with anyone to shore up our economic development tools so we can keep creating jobs and bringing critical supply chains home.” “Today’s investments in Highland Park and Bay City will create 543 good-paying jobs and build on our strong manufacturing leadership,” said Governor Whitmer. “Norplas, an auto supplier, and HL Mechatronics, a cutting-edge R&D firm, are both expanding their footprints in Michigan, betting on the bright future of our state. We will c osperity.\" “Today's announcement by Norplas Industries and HL Mechatronics are a testament to Michigan’s foundation in the manufacturing sector. They could have chosen to expand anywhere in the country, or world for that matter, and the fact that they chose Michigan points to the state’s heritage, pedigree, and talented workforce to meet the needs of growing companies,” said Matt McCauley, Senior Vice President, Regional Development at the MEDC. \"We remain focused on executing the Make it in Michigan economic development strategy of attracting and developing people, cultivating and revitalizing places, and competing for and winning projects is working. We applaud these two companies and are excited to see their continued growth and pr e a major boost to that area specifically and to Wayne County as a whole.” “Wayne County has come a long way in the past few years, and the project being proposed by Magna is yet another example of the rapid progress we are making in rebuilding our community through economic development,” said Warren C. Evans, Wayne County Executive. “The company’s proposed investment of more than $6 million to be made in Highland Park in terms of jobs, money, and new manufacturing capabilities promises to b nt and future customer needs. HL Mechatronics is announcing their plans to purchase two 140,000-square-foot facilities in Williams Township to accommodate engineering offices and research and development testing capacities for growth to meet curre y global automotive distributors. The company currently employees 98 Michigan residents. HL Mechatronics, founded in 2013 and headquartered in Bay City, is a North American subsidiary of HL Group. The company is a state-of-the-art research and development facility that is committed to the design of electronics, embedded systems, and magnetics for use in many precision motor control applications. Focusing on the designing and testing of steering, brakes, and propulsion technology to final production, the company’s portfolio of customers includes top automotive companies and man ternship level, as well as for full-time entry-level positions. In addition to MSF support, the company partners with Michigan Technological University, University of Michigan, Michigan State University, and Saginaw Valley State University to recruit, retain, and grow talent at the in",
  "url": "https://www.michiganbusiness.org/press-releases/2025/04/new-jobs-wayne-bay-counties/",
  "date": "2025-04-24"
}