{
  "title": "Compass Datacenters project generates $10 billion investment in Lauderdale County",
  "content": "Project will be one of the largest hyperscale data center developments in the southeast and Compass’ first campus in the region stance for site preparation. MDA also will certify Compass Datacenters as a data center operator, which will provide the company with 10-year state income and franchise tax exemptions, as well as a sales and use tax exemption on construction materials, equipment and software and hardware replacements. The city of Meridian, Lauderdale County and electrical utility provider Mississippi Power Company also are assisting with the project. Mississippi Power will supply approximately 500 megawatts of power to the facility.Mississippi Development Authority is providing assi e an impressive economic development streak that is unprecedented in Mississippi. Through our pro-business policies and favorable business environment, we continue to establish our state as an ideal location for high-tech developments by providing the resources needed for innovation and growth. I thank the Compass Datacenters team for its well-placed confidence in our people and in our business climate, which will provide ample opportunities for the company and the residents of Meridian and Lauderdale County now and for generations to come.” – Gov. Tate Reeves“This $10 billion megadeal is huge for Lauderdale County and the entire state as we continu ent team in Mississippi is second to none, and we are excited to continue bringing great job opportunities to the citizens of our great state.” – Mississippi Development Authority Executive Director Bill Cork“Compass Datacenters’ multi-billion investment in Meridian marks yet another monumental economic development win for Mississippi, and it is the result of many factors that position our state as a hub for these high-tech projects. Speed to market, the availability of a shovel-ready site in Meridian I-20/59 Industrial Park and the capabilities of Mississippi Power were key to Compass Datacenters choosing Lauderdale County. The economic developm , an additional MDA site grant and the city of Meridian’s water/sewer investment years ago, truly made this site a speed to market option for Compass. Thank you Compass Datacenters for selecting Meridian, Lauderdale County for your Mississippi campus.” – East Mississippi Business Development Corporation President Bill Hannah“Since meeting the Compass Datacenter folks in February 2024, it has been one exciting experience. First, we need to thank Mississippi Power for bringing Compass to us. Mississippi Power’s investment in a substation for the I-20/59 Industrial Park, along with Lauderdale County’s ability to work with the Mississippi Legislature for a $4 million site grant “Mississippi Power has been an integral part of the economic development effort to bring more jobs and industries to our state for nearly a century. Mississippi Power has the generating power to support a growing Mississippi while maintaining reliable service for our customers. Our company is proud to be a part of the strategic team that delivered this significant investment to East Mississippi.” – Mississippi Power President and CEO Anthony Wilson",
  "url": "https://medc.ms/news/article/compass-datacenters-project-generates-10-billion-investment-in-lauderdale-county",
  "date": "2025-03-24"
}