{
  "title": "Newlab Expands to Louisiana with New Energy-Focused Innovation Hub",
  "content": "ouisiana Economic Development.“We’re excited to welcome Newlab to Louisiana as the state expands what it means to be an energy leader. By fostering collaboration between startups, industry experts, and policymakers, Louisiana is setting a benchmark for how reindustrialization can drive sustainable economic growth, energy innovation, and technology leadership on a global scale,” said Josh Fleig, Chief Innovation Officer at L astal Industrial Canal and the Mississippi River. The NSA complex formerly operated as a 1.5 million square foot logistics center for the U.S. Navy, with the last military personnel departing the base in 2011. As part of the master plan by local developers, EMDRC Partners, and the City of New Orleans to reimagine the NSA campus, Newlab New Orleans will help to reactivate the historic site by creating a center of gravity for critical technology startups to drive measurable economic impact in the state.Newlab New Orleans will be anchored in a purpose-built, newly constructed hub at the Naval Support Activity (NSA) site located at the intersection of the Interco o strategic regions like Louisiana that have a competitive advantage for speeding up commercialization of critical technologies. Louisiana’s legacy in commercial-scale energy projects, existing industrial infrastructure, and technical workforce create the perfect foundation to build a startup ecosystem that will future-proof the state’s economy,” said David Belt, Co-founder and CEO of Newlab.“We’re bringing Newlab t of Research and Economic Development, Louisiana State University.“Newlab’s expansion into New Orleans and Louisiana signifies to the rest of the nation that with partners like LSU, LED, GNO, Inc., and the City of New Orleans, energy innovation is happening here faster than anywhere else. Newlab’s proven approach to developing deep technology complements our research agenda and industry partnerships. LSU’s Future Use of Energy in Louisiana (FUEL) award, the largest in National Science Foundation history, is a key reason the Newlab project moved so quickly, and we’re excited to keep that pace for energy founders in Louisiana,” said Dr. Robert Twilley, Vice President ns is partnering with N2 Solutions, a Louisiana-based pipeline service provider to retrofit natural gas transmission pipelines for safe and cost-effective transport of CO2 and hydrogen. Another startup, Mantel Capture, is collaborating with Newlab and regional industry partners to deploy their point-source carbon capture technology in Louisiana.Newlab’s work in Louisiana began last year through two U.S. Department of Energy-backed programs focused on accelerating the commercialization of clean hydrogen and carbon management technologies. Through these programs, Newlab structured commercialization projects in Louisiana with nine startups and industry partners including Shell, Battelle, and Carbonvert. Among the participants being supported by Newlab, Arculus Solutio tel.“Where the rubber meets the road is at the state level. Our work with Newlab is our anchor in Louisiana, a state that has long been a center for energy in the U.S. and, as a result, a major hub for CO2 emissions. That makes it a strategic location for carbon capture projects. Newlab has been instrumental in getting these projects off the ground by connecting us with key stakeholders, including state and local governments and communities. It’s crucial we put their needs first and address them throughout the entire technology development and deployment process, and Newlab has been a key part of making that happen,” said Cameron Halliday, Co-founder & CEO at Man rogramming in additional regions. To date, Newlab has partnered with over 50 industry and government leaders and has supported its 400+ member companies in raising over $5.8B from venture capital firms, with over $2.3B of successful exits and a collective valuation of over $20B. Visit www.newlab.com to learn more.Newlab is a venture platform for critical technology startups transforming core industrial sectors. We help startups commercialize faster by aligning Infrastructure, Projects, and Capital in locations with strategic advantages. Newlab operates 5 innovation hubs globally and manages active pilot p .9021, emily.gonthier@newlab.com Emily Gonthier, Newlab, 516.970",
  "url": "https://www.opportunitylouisiana.gov/news/newlab-expands-to-louisiana-with-new-energy-focused-innovation-hub",
  "date": "2025-05-12"
}