{
  "title": "Air Dome Manufacturer Relocates to Cumberland County",
  "content": "uild our manufacturing facility and continue to produce world-class air-supported domes,” said CEO Matt Mejia. “We’re grateful for the support of Governor Stein, and our many partners throughout North Carolina. We look forward to joining the community and expanding Yeadon’s 55-year legacy in Cumberland County.”“Yeadon Fabric Domes is thrilled to be expanding our operations to Fayetteville. Throughout the process, it has become clear that Fayetteville is the perfect place to b rowth. By investing in businesses like Yeadon Fabric Domes, we are building a brighter, more prosperous future for Cumberland County.”“Cumberland County is excited to welcome Yeadon Fabric Domes,” said Board of Commissioners Chairman Kirk deViere. “This project will not only create high-quality jobs for our residents but also strengthen our position as a hub for innovative manufacturing. We are proud to support this project and look forward to the positive impact it will have on our local economy, workforce, and future g r great state.”“We are delighted to welcome Yeadon Fabric Domes to Cumberland County,” said Governor Stein. “Our manufacturing leadership and textile legacy woven with our strategic location and excellent quality of life will continue to attract innovative, global companies to ou h a population estimate of 342,082. The County functions under a Board of Commissioners-County Manager form of government. There are nine municipalities within Cumberland County to include the City of Fayetteville. Cumberland County serves citizens with PRIDE (Professionalism, Respect, Integrity with Accountability, Diversity and Excellent Customer Service). To learn more about Cumberland County visit www.cumberlandcountync.gov.ABOUT CUMBERLAND COUNTY: Cumberland County is the fifth largest county in North Carolina wit rvices, please visit fayettevillenc.gov or follow us on Facebook, Instagram, Twitter or LinkedIn.ABOUT CITY OF FAYETTEVILLE: The City of Fayetteville is a dynamic, culturally-rich community committed to high performance, transparency and innovation. Directly adjacent to Fort Liberty, Fayetteville is home to more than 208,000 residents. The mission of the City is to provide sustainable, high-quality public services for our communities to thrive and businesses to grow. With creative energy, vibrant history and compassionate people, Fayetteville always finds a way. That’s why we are America’s Can Do City. To learn more about the City of Fayetteville and City departments or se",
  "url": "https://fcedc.com/air-dome-manufacturer-relocates-to-cumberland-county/",
  "date": "2025-03-18"
}