{
  "title": "68,000-SF Celebration Medical Center Breaks Ground in Gilbert",
  "content": "Construction starts on Celebration Medical Center amid growth in the East Valley g outpatient facilities’ rising demand and critical importance in the evolving healthcare landscape,” said Garret Clifford with Okland Capital.“We are thrilled to break ground on this highly anticipated project in the heart of the Mercy Gilbert Medical Corridor. This development represents a significant opportunity to bring a premium healthcare experience to the community, combining elevated architectural design with accessible, off-campus medical services. As one of the last available parcels for medical use in this corridor, we are creating a destination that will meet the growing demand for outpatient care and provide an iconic space for physicians and healthcare providers to serve patients at the highest level. We aim to deliver a seamless, refined environment that prioritizes accessibility and premium healthcare amenities, reflectin the tenants to draw on other medical synergy nearby,” said Philip Wurth, senior vice president at CBRE.“Demand for medical office space has grown substantially, especially in the East Valley. Celebration Medical Center offers cutting-edge features that modern healthcare tenants need in these high-growth markets. The building’s proximity to Dignity Health Mercy Gilbert Hospital campus and other healthcare providers will enable “By offering direct access from Mercy Road, prominent signage opportunities, and no use restrictions from the nearby hospital, this facility ensures a premium experience for medical providers and patients. With nationwide demand for healthcare real estate outpacing supply since 2021 and off-campus occupancy growing at twice the rate of on-campus facilities, this development will be instrumental in shaping the future of patient care and community-based health services in the region,” added Clifford.",
  "url": "https://www.gilbertedi.com/68000-sf-celebration-medical-center-breaks-ground-in-gilbert/",
  "date": "2024-12-02"
}