{
  "title": "Governor Lee, Commissioner McWhorter Announce Aspen Guard, a Troax Group Company, to Relocate U.S. Manufacturing Operations to Robertson County",
  "content": "NASHVILLE, Tenn. – Tennessee Gov. Bill Lee, Department of Economic and Community Development Commissioner Stuart C. McWhorter and Troax Group officials announced today the company will establish its first Aspen Guard manufacturing facility in Tennessee, relocating operations from the Greater Chicago area to Portland. workforce. We are proud to welcome this company to Tennessee and look forward to the opportunity these 120 new jobs will bring to families across Robertson County.” – Gov. Bill Lee“Tennessee continues to lead the nation with one of the fastest growing economies thanks to companies like Troax Group, which continue to place their trust in our state and skilled ing. This investment underscores our commitment to the region, promising new jobs and a vibrant hub for ideas, talent and innovation.” – Troax Group Americas President Jose Nunez“Troax Group is pleased to announce a major investment in Tennessee, marking a significant step in expanding our North American manufacturing operations. Our new Aspen Guard facility in Portland, serving both Folding Guard and Troax brands, will enable us to better provide our customers with top-tier mesh panel solutions for safe storage, machine guarding and warehouse partition obs, and we are thankful for our partnership with TNECD, our local Industrial Development Board and Robertson County as we work to expand employment opportunities within our city.” – Portland Mayor Mike Callis“The City of Portland is excited to announce another manufacturer locating to our community. Troax Group is known for its product lines that provide safety, security and storage solutions. The State of Tennessee is committed to recruiting high quality j o the growth and prosperity of the Middle Tennessee region. A heartfelt thank you to everyone who played a role in making this exciting opportunity a reality.” – Sen. Kerry Roberts (R-Springfield)“Troax Group has been a trusted leader in safety, security and storage solutions for decades. I am excited to announce that the company is expanding to Tennessee with a significant investment of over $22 million in Robertson County. This expansion will create 120 new jobs, contributing t tment of Economic and Community Development (TNECD)About the Tennessee Depar",
  "url": "https://tnecd.com/news/governor-lee-commissioner-mcwhorter-announce-aspen-guard-a-troax-group-company-to-relocate-u-s-manufacturing-operations-to-robertson-county/",
  "date": "2025-05-01"
}