{
  "title": "Governor Lee, Commissioner McWhorter Announce Craig Manufacturing USA, Inc. to Expand Manufacturing Operations in Lawrence County",
  "content": "LAWRENCEBURG, Tenn. – Tennessee Gov. Bill Lee, Department of Economic and Community Development Commissioner Stuart C. McWhorter and Craig Manufacturing USA, Inc. officials announced today the company will expand its manufacturing operations in Lawrence County. billion and creating approximately 3,800 jobs statewide.Canada is the state’s No. 3 partner for foreign direct investment with Canadian companies investing nearly $1.7 rnmental partners have been crucial to our growth. Thanks to their support and hard work, today, we are able to expand into new and larger products as we continue to build the tools that build America. We are excited about the opportunities this growth will bring for our company and the local Lawerence County community for many years to come!” – Ben Craig, president, Craig Manufacturing“We are thrilled to announce the expansion of our operations in Tennessee. The skills and dedication of our local team and the steadfast support of our customers, community and gove in Lawrence County. We celebrate this milestone with great pride and look forward to what’s next.” – Lawrence County Executive David Morgan“Craig Manufacturing represents the best of what we hope for in an economic development partnership – supporting local families, reinforcing our skilled workforce and strengthening our economy. Their continued growth speaks volumes about the kind of future we’re building together continued commitment to growth in the region. We are proud to partner with the Lawrence County Chamber of Commerce, Middle Tennessee Industrial Development Association and the Tennessee Department of Economic and Community Development to support companies like Craig Manufacturing, and we celebrate this announcement together.” – John Bradley, TVA senior vice president of economic development“TVA and Lawrenceburg Utility Systems congratulate Craig Manufacturing on its decision to expand operations in Lawrence County. It’s always an exciting day when we can celebrate a company’s is helping us build a stronger local economy. We’re proud to see their continued growth in Lawrenceburg.” – Rep. Kip Capley (R-Summertown)“Craig Manufacturing’s decision to expand in Lawrence County shows confidence in our workforce and commitment to our community. By adding 30 new jobs and investing $4.4 million, Craig Manufacturing nChris O’Brie Chris.OBrien@tn.gov",
  "url": "https://tnecd.com/news/governor-lee-commissioner-mcwhorter-announce-craig-manufacturing-usa-inc-to-expand-manufacturing-operations-in-lawrence-county/",
  "date": "2025-05-16"
}