{
  "title": "First-Ever Uncrewed Triple Challenge Advances State’s Leadership in Aerial Mobility Innovation",
  "content": "ANSING, Mich. – Today, Governor Gretchen Whitmer kicked off the Uncrewed Triple Challenge (UTC), a groundbreaking, state-sponsored competition of autonomous drones across water, air, and land. Michigan continues to lead the nation in uncrewed systems innovation with the inaugural, first-of-its-kind event as a bold initiative to fuel technological innovation, attract investment, and create jobs in Michigan’s growing autonomous mobility sector. her to get things done,” said Governor Whitmer. “I’m excited to kick-off the Uncrewed Triple Challenge and figure out ways we can use this autonomous drone technology to deliver medicine, cut down on delays in manufacturing, and save people time and money. By forging partnerships between state departments, the Michigan National Guard, and defense and tech businesses, we’re showing the world that Michigan isn’t just ready for the future—we're building it.” “This unique challenge, the first of its kind, puts Michigan on the cutting-edge of mobility and cements our reputation as a state that knows how to bring people toget A maritime segment beginning at the Alpena harbor to a point 5 nautical miles offshore in Thunder Bay that our state has to offer businesses in the mobility, defense, and aerospace sectors and invite entrepreneurs looking to build great companies to ‘Make It’ in Michigan.” “This Uncrewed Triple Challenge competition demonstrates that Michigan is not just the birthplace of mobility – but also we’re the proving ground for its future by air, land and water,” said Quentin L. Messer, Jr., CEO of the MEDC. “The UTC showcases the Team Michigan collaboration among our public sector, defense industry, and tech entrepreneurs to drive real-world innovation and job creation. We’re showcasing all technologies can support a wide range of missions, including delivering medicine and critical equipment to military personnel.” \"Michigan has always been a pioneer in our nation’s defense, from the days when Detroit was known as the Arsenal of Democracy to today’s cutting-edge efforts in autonomous systems,\" said U.S. Army Maj. Gen. Paul D. Rogers, adjutant general and director of the Michigan Department of Military and Veterans Affairs. \"We are proud to host the inaugural UTC at the NADWC, which includes the Camp Grayling Joint Maneuver Training Center and Alpena Combat Readiness Training Center, facilities instrumental in strengthening National Guard readiness and supporting Department of Defense priorities. The UTC showcases the innovative spirit driving Michigan’s defense and manufacturing sectors and highlights how emerging drone ghest concentration of electrical and mechanical engineers in the nation. Michigan has the hi",
  "url": "https://www.michiganbusiness.org/press-releases/2025/05/first-ever-uncrewed-triple-challenge/",
  "date": "2025-05-20"
}