{
  "title": "Transformational Economic Development Project Bringing 2,000 High-Wage Jobs to Overland Park",
  "content": "verland Park, Kan., April 21, 2025 – In a major win for the State of Kansas and the Kansas City region, the Aspiria campus in Overland Park has been selected as the site of one of the largest job-creating economic development projects in state history. The project, months in the making, will bring 2,000 new high-paying jobs to the city and inject a significant boost into the regional economy. ound the world. This new location will be home to a wide range of high-tech financial services roles further strengthening Overland Park’s position as a growing hub for innovation and digital transformation in the financial sector.Fiserv, a global leader in payments and financial technology, will establish a major operational hub in Overland Park. The company provides essential fintech and payment solutions to thousands of financial institutions and businesses ar r employees to our city.\"“We are proud to welcome Fiserv to Aspiria and Overland Park,” stated Overland Park Mayor Curt Skoog. “Overland Park is already a strong hub for business and technology leadership, and Fiserv is a natural fit in our community. The thousands of jobs Fiserv brings, along with the potential to serve neighboring businesses within our thriving community, is a significant win. I look forward to welcoming Fiserv leadership and thei and transportation.The broader impact of this project is equally impressive. Based on a projected economic multiplier of 7.9, the 2,000 direct jobs created are expected to result in more than 15,800 total jobs influenced throughout the community. This includes sectors such as retail, restaurants, construction, engineering, utilities, housing, “This is a transformational project not only for Overland Park, but for the entire region,” said Libbey Tucker, Senior Vice President of Economic Development for the Overland Park Chamber of Commerce. “The scope and scale of this investment—both in terms of job creation and private capital—will deliver generational impact. It reflects the strength of our market, our commitment to business partnership, and the unique quality of life Overland Park offers to companies and their employees.”",
  "url": "https://www.opchamber.org/2025/04/21/news-release-transformative-project-bringing-2000-high-wage-jobs-to-overland-park/",
  "date": "2025-04-21"
}