{
  "title": "240 New Jobs Coming to Kent & Oakland Counties",
  "content": "OVD Insurance announces acquisition of Grand Rapids building, creates 131 new jobs and TYC Americas establishes new facility in Wixom, creates 109 new jobs tting on Michigan and doubling down on our state because of our strong network of talent and quality of life. Together, let’s keep growing our professional services industry and competing against other states and nations to bring advanced manufacturing home.” “Today’s expansions by OVD Insurance and TYC Americas will create 240 new, good-paying jobs in and drive nearly $31 million of investment in Grand Rapids and Wixom,” said Governor Whitmer. “Both these companies are be ship with CWD Real Estate Investment is announcing the purchase of the 7-story, 99,000 square-foot office building located at 37 Ottawa Avenue Northwest in the heart of downtown Grand Rapids. OVD, with offices in Grand Rapids, Pittsburgh, and Raleigh, as well as partnerships in Dallas and Nashville, plans to make significant investments into the building throughout 2025 and anticipates their move to be late Q3 or Q4 this year. OVD Insurance is a full-service, independent insurance brokerage located in Wyoming, MI that has experienced significant growth, having doubled in the last five years. To accommodate its growth, OVD Insurance in partner le, and we’re committed to attracting and retaining top talent.” “We are in the people business,” Van Vels adds. “We have world-class peop to West Michigan.” “West Michigan is continually growing as a competitive place for businesses to thrive and for young workers to secure good-paying jobs and put down roots — and investments like this $1 million business development grant make all the difference in ensuring we can continue building on this economic progress here in Grand Rapids,” said Senate Majority Leader Winnie Brinks (D-Grand Rapids). “Congratulations to the grant recipient, Wyoming’s very own OVD Insurance. Let’s keep working together to bring more new jobs, businesses, and capital investment home nies need to thrive.” “We’re excited OVD Insurance has chosen to grow their headquarters in the heart of Grand Rapids,” said Andria Romkema, Senior Vice President of Business Development at The Right Place, Inc. “OVD’s decision to locate their corporate HQ in the city will bring more energy to an already vibrant downtown and speaks to the region’s ability to attract the highly skilled talent our compa hour. The company is announcing they are establishing a new facility in Wixom to service current and future customers throughout North America that will bring manufacturing operations from China and Taiwan to Michigan. The expansion project is expected to generate $18,750,000 in capital investment along with the creation of 109 new jobs paying between $24 and $55 per hour plus benefits, which is above the regional median wage of $23.73 per significant investment into our community.” “The City of Wixom is thrilled to welcome TYC Americas and their new research and development hub to the community. They have a beautiful facility, and we’re excited to support their growth and success over the coming years,” said Drew Benson, Assistant City Manager & Director of Economic Development for the City of Wixom. “There is a long history of high-end manufacturers like TYC finding success in Wixom, and we sincerely appreciate TYC’s innovative presence and The company’s parent, TYC Brother Industrial, was founded in Taiwan in 1964. In 1991 they began doing business in the United States and today have five distribution centers with approximately 150 employees, 10 of which are Michigan residents. For those looking to pursue a career with TYC Americas, learn more here.",
  "url": "https://www.michiganbusiness.org/press-releases/2025/03/240-new-jobs-coming-to-kent-oakland-counties/",
  "date": "2025-03-27"
}