{
  "title": "Green Fuels Operating Announces $110 Million Investment to Transform Historic Evangeline Processing Facility",
  "content": "exceeding 350,000 barrels, and will remain operational while the new GFO refining unit is developed.In addition to Green Fuels deploying its NZET technology at the shuttered Acadiana facility, which first opened in 1957, GFO plans to develop a 20,000 barrel-per-day refining unit dedicated to producing marine-grade diesel and bunker fuel. The existing facility located in the unincorporated community of Evangeline is outfitted with 15 storage tanks that have a total capacity il here at home rather than shipping it overseas only to buy back finished fuels at premium prices,” GFO CEO Derek Williamson said. “Our revolutionary NZET refining technology solves the 150-year-old problem of refinery emissions, enabling us to build clean refineries in the communities where oil is produced, creating local jobs and energy security.”“America’s energy independence requires more than just drilling — it demands that we refine our own o rating’s $110 million investment is a game-changer for Acadia Parish,” Acadia Parish Chamber of Commerce & Economic Development President & CEO Elizabeth I. Miller said. “This project brings together innovation, sustainability, and economic opportunity in a way that honors our energy legacy while forging a bold path forward. We’re proud to see this kind of forward-thinking development choosing Acadia Parish — creating quality jobs, revitalizing a historic asset, and reinforcing our position as a hub for cutting-edge energy solutions.”“Green Fuels Ope resident and CEO Troy Wayman said. “GFO’s investment is a perfect example of how Acadiana’s energy legacy and future are deeply connected. This project strengthens our local workforce, supports regional producers, and demonstrates how innovation and legacy can work together to drive real economic impact for Acadiana.”“We’re thrilled to see this significant investment coming to Acadia Parish, revitalizing a historic facility while bringing next-generation energy technology to our region,” One Acadiana P energy production.Green Fuels Operating is an Oklahoma based company and is the global leader in net-zero emissions fuel production. Its proven, patented NZET system revolutionizes oil refining with its odor-free clean refining technology, becoming the world’s leader in low-cost, environmentally responsible hydrocarbon processing solutions. GFO facilities produce locally-needed supplies of sustainable fuels, including diesel, jet fuel, sustainable aviation fuel (SAF), marine-grade bunker fuels, road and roof asphalt binders, positioning it as a leader in low-carbon",
  "url": "https://www.opportunitylouisiana.gov/news/green-fuels-operating-announces-110-million-investment-to-transform-historic-evangeline-processing-facility",
  "date": "2025-05-23"
}