{
  "title": "Governor Northam Announces Joint Venture to Invest $267 Million in Paperboard Recycling and Production in Chesapeake, Creating 210 New Jobs",
  "content": "New operation will advance U.S. recycling technology, become one of Virginia’s largest exporters years to come, especially as we build out our clean economy. We look forward to a long and productive partnership with the company.”“Celadon Development Corporation’s state-of-the-art operation will produce in-demand fibers from recycled paper products, benefitting the environment and positioning Chesapeake and the Commonwealth as pioneers of this exciting recycling technology in the U.S.,” said Governor Northam. “The capital investment, new jobs, and environmental stewardship opportunities provided by this project will pay dividends for value annually.Celadon’s 335,000-square-foot facility will utilize the most efficient processes, creating a closed loop, waste-free industry. At its peak, this operation may use up to 300 rail cars per month and export 80,000 TEUs, or twenty-foot equivalent units, per year, equivalent to 10 cargo ships, through The Port of Virginia. At full capacity, Celadon would represent one of the largest exporters in Virginia, with approximately $200 million in export ployment and Investment Project Approval Commission to secure the project for the Commonwealth. Governor Northam approved a $2 million grant from the Commonwealth’s Opportunity Fund to assist the City of Chesapeake with the project. The company is eligible to receive benefits from the Port of Virginia Economic and Infrastructure Development Zone Grant Program. Funding and services to support the company’s employee training activities will be provided through the Virginia Jobs Investment Program.The Virginia Economic Development Partnership worked with the City of Chesapeake, the Hampton Roads Alliance, The Port of Virginia, and the General Assembly’s Major Em ake,” said Major Employment and Investment Project Approval Commission Vice Chair Delegate Luke Torian. “The company’s new operation will advance U.S. recycling technology, and I am pleased the MEI Commission could collaborate with our state, regional, and local partners to help secure this project.”“We thank Celadon for its $267 million investment and creating 210 new jobs in the City of Chesape ake and the Hampton Roads Region have one of the most skilled and diverse workforces in the country.”“Having this state-of-the-art facility locate in the City of Chesapeake highlights not only a large capital investment, but also the commitment to bringing good-paying jobs to the citizens of the city,” said Steven Wright, Director of Economic Development for the City of Chesapeake. “These new jobs in green technologies will further show that Chesape is is very clearly a win for Virginia and for The Port of Virginia,” said Stephen A. Edwards, Chief Executive Officer and Executive Director of the Virginia Port Authority. “At full capacity, Celadon will produce a significant amount of material for export that will move over our port. This is an international company that has made a strategic decision to build here and access world markets via The Port of Virginia. Presently the port is investing to ensure it is ready for the future and we look forward to growing in tandem with Celadon and serving as its global gateway for decades to come.” “The importance of Celadon investing nearly $270 million to develop its operation in Chesapeake cannot be overstated–th .”“The $267 million that Celadon will invest in the City of Chesapeake will create 210 new jobs and bring lasting positive economic impact to the region,” said Senator L. Louise Lucas. “Furthermore, the company’s commitment to the environment and advanced technology while also utilizing The Port of Virginia makes this a great project not only for the 18th Senatorial District, but the Commonwealth as a whole",
  "url": "https://chesapeakeva.biz/celadon-joint-venture/",
  "date": "2022-01-11"
}