{
  "title": "Atlanta Based Medical Weight Loss Company Expands Pharmaceutical Manufacturing Operations in Hillsborough County",
  "content": "Spears, CEO and founder of OrderlyMeds. “Our investment in this compounding pharmacy will eventually create hundreds of new jobs, support the local community, and serve our growing customer community while driving our next phase of growth.”“Choosing Tampa felt like a natural fit due to the strong healthcare ecosystem and its position as a growing hub for healthcare innovation,” said Chris aid Ron Christaldi, chair of the Tampa Bay Economic Development Council; partner at Shumaker; and president and CEO of Shumaker Advisors Florida. “With the exceptional talent available here, we are confident that they will find the professionals they need to rapidly expand and succeed in our market.” “OrderlyMeds is a welcome addition to our growing sector of innovative life sciences companies,” s r dedicated to delivering innovative and effective solutions for individuals seeking to improve their health and well-being. With a focus on personalized care and cutting-edge treatments, OrderlyMeds is committed to making a positive impact on the lives of its customer community. Visit www.orderlymeds.com.OrderlyMeds is a leading healthtech solutions provide d Manufacturing. The EDC exists because of the generous support of more than 100 corporations, Hillsborough County, and the cities of Tampa, Plant City and Temple Terrace. For more information, visit www.tampabayedc.com.The Tampa Bay Economic Development Council is the lead designated economic development agency for Hillsborough County and the cities of Tampa, Plant City and Temple Terrace. Established in 2009 as a partnership between the public sector and private corporate investors, the EDC works to advance a diversified local economy that is beneficial to all by attracting, expanding and retaining quality employers, a talented workforce and investment, focusing within targeted industry sectors, including Corporate Headquarters, Financial and Professional Services, Information Technology, Life Science and Health Care, Defense and Security, Distribution and Logistics, an",
  "url": "https://tampabayedc.com/news/atlanta-based-medical-weight-loss-company-expands-pharmaceutical-manufacturing-operations-in-hillsborough-county/",
  "date": "2025-04-29"
}