{
  "title": "Elopak Opens First U.S. Carton Plant at Little Rock, Arkansas",
  "content": "LITTLE ROCK, Ark. (April 30, 2025) – Global packaging company Elopak today opened its first ever U.S. carton converting plant in Little Rock, Arkansas. The state-of-the-art factory costs USD 100 million and will produce Pure-Pak® cartons for liquid dairy products, juices, plant-based drinks, and liquid eggs. p towards achieving that goal,” he added.“I am sincerely grateful to the whole team at Elopak Americas, as well as local officials, for helping us to deliver this factory on budget and on time. This plant is a cornerstone of our ‘Repackaging tomorrow’ strategy to double revenues by 2030. Today, I am very excited that we have taken a big ste r 2024, Elopak announced it was bringing forward plans to add a second production line at the plant after initial capacity sold out before the factory even opened. This line will be fully operational in 2026 and will contribute a further USD 110 million in annual revenue.The company first announced plans to build a U.S. production plant in June 2023 and construction started in March 2024, taking just under a year to complete. In Septembe ination for international companies looking to grow, and we are proud that Elopak has invested in our state. Elopak’s state-of-the-art facility in Little Rock, Arkansas represents a significant investment of $100 million – but more importantly, it’s an endorsement of our state as a business-friendly location where companies can thrive. This grand opening is a cause for celebration, and we look forward to Elopak’s success and the jobs that the facility will create.”Clint O’Neal, executive director of the Arkansas Economic Development Commission: “Arkansas is a dest -the-art facility. We are certain that Elopak will play an active role in championing Pulaski County around the world.”Barry Hyde, Pulaski County Judge: “Pulaski County has supported Elopak on every step of the journey to delivering this state-of ”Jay Chesshir, President and CEO of the Little Rock Regional Chamber: “This investment started as a nationwide site selection search and is now coming to life in Little Rock. From completing the initial request for proposal all the way to cutting the ribbon on this new facility today, the Little Rock Regional Chamber team has walked every step with Elopak’s leadership and is committed to supporting them for decades to come. omic opportunities, making Arkansas the natural choice for success. AEDC is a division of the Arkansas Department of Commerce. To learn more, visit ArkansasEDC.com.At AEDC, we know economic advancement doesn’t happen by accident. We work strategically with businesses and communities to create strong econ The Little Rock Regional Chamber is the principal business-driven leadership organization responsible for fostering the economic growth and development of the Little Rock region to ensure that business and industry may operate profitably and enhance the earning opportunities and quality of life for every citizen. For more information, visit littlerockchamber.com.",
  "url": "https://www.arkansasedc.com/news-events/newsroom/detail/2025/04/30/elopak-opens-first-u.s.-carton-plant-at-little-rock-arkansas",
  "date": "2025-04-30"
}