{
  "title": "90 New Jobs, Cutting-Edge Medicine Coming to Detroit with BAMF Health Facility",
  "content": "BAMF Health will create a new comprehensive Theranostics Center and Radiopharmacy in Downtown Detroit AMF Health will create a new comprehensive Theranostics Center and Radiopharmacy in Downtown Detroit, which will provide direct personal medical services to patients receiving treatment for diseases such as cancer. The project includes the establishment of a molecular imaging clinic, a molecular therapy clinic, and a commercial manufacturing radiopharmacy. B ed value of up to $982,000 for its $45,000,000 eligible investment in Eligible Personal Property. The project is being supported by MSF Board through a $1.5 million Michigan Business Development Program performance-based grant and approval of a 15-year 100% SESA Exemption with an estimat , our bipartisan partners in the state legislature, and the volunteer MSF Board for their ongoing support of the Michigan Business Development Program grant tool. Congratulations to BAMF Health on their growth to Southeast Michigan where additional care will benefit the lives of more Michiganders.” “Today’s MSF approval of BAMF Health’s new facility in Detroit will build on Michigan’s leadership in cutting-edge health science, helping us deliver on the state’s ‘Make It in Michigan’ economic development strategy of supporting People, Places, and Projects,” said Quentin L. Messer, Jr., CEO of the Michigan Economic Development Corporation and Chair of the MSF Board. “I’m grateful to Governor Whitmer his site not only enables us to deliver life-saving care to patients in southeast Michigan, it also serves as a gateway for patients across the country to access the most advanced imaging and treatments. Our work at the Gratiot Site is poised to drive innovation in healthcare technology.” “We are grateful for the continued support of Governor Whitmer and the Michigan Strategic Fund and their shared commitment to making our state a national leader in precision medicine through novel radiopharmaceuticals,” said Anthony Chang, PhD, founder and CEO of BAMF Health. T l of BAMF Health’s innovative Theranostics Center in downtown Detroit is akin to planting a seed in already fertile ground. This project will grow the city’s burgeoning medical ecosystem and bring next-generation cancer therapies to Detroiters,” said Kevin Johnson, president and CEO of the Detroit Economic Growth Corporation. “The DEGC proudly supported BAMF during our 2.5-year attraction effort alongside the MEDC. We are grateful to the MSF Board for their support of this transformative development.” “The arriva “Ensuring Michiganders have access to the medical centers they need is important for any community, and it is especially critical for someone facing a health hardship,” said State Representative Joe Tate (D-Detroit). “The creation of this new theranostics center and radiopharmacy in Downtown Detroit would provide lifesaving care to those battling medical challenges like cancer. I applaud the commitment to our community and the relief this center will bring for many Detroiters.”",
  "url": "https://www.michiganbusiness.org/press-releases/2025/04/bamf/",
  "date": "2022-04-22"
}