{
  "title": "Expertec Acquires Work Truck Solutions, Announces First US Expansion in Gilbert, Ariz.",
  "content": "ng aims to ensure a seamless transition for customers and to unify the brand under a single, strong identity. Together, they will further commit to their service philosophy: Where Partnership meets Precision; Delivering Solutions with Innovative Excellence.Effective immediately, Work Truck Solutions will be rebranded and operate under the Expertec name in Gilbert. This rebrandi e to open its first U.S. location in Gilbert after considering many other cities in the western U.S. and evaluating economic and social factors in each region. Ultimately, the strong support from key vendors and the strategic advantages of Greater Phoenix made it the optimal choice for Expertec’s expansion.Expertec chos tandards of quality and trusted advisory that both Expertec and Work Truck Solutions are known for.This acquisition and expansion not only solidifies Expertec’s standing in the North American market but also positions it as one of the few companies capable of fully servicing multinational clients. Customers can expect a broader range of services, efficient lead times, and the same high s ec retains both a corporate and a retail presence in Edmonton but also operates facilities in Calgary, Alberta and Abbotsford, B.C. The success of Expertec is driven by a commitment to quality and a carefully chosen network of commercial suppliers across Canada and the United States to provide the best upfitting solutions for both trucks and vans. Expertec offers top quality vehicle equipment for work trucks and vans to meet even the most demanding of jobsites, trades, and fleet requirements. From van shelving and ladder racks to slip-in service bodies and power liftgates, Expertec can outfit commercial fleets and contractors, no matter their size. The goal of Expertec since day one has been to provide a true “one stop shop” as a commercial van and work truck outfitter. www.expertec.ca/about-us/Expertec was founded in Edmonton, Alberta over two decades ago and is the premier outfitter for trucks and vans in Western Canada. Today, Expert rovides expert site selection services inclusive of operational cost analysis, incentive comparisons, workforce studies, research and information reflective of state and local tax structures, connectivity to key resources, and project management. With access to an educated and diverse workforce, a pipeline of emerging technologies from statewide universities, ease of market access, and an unbeatable quality of life, world-class companies are choosing Gilbert. Gilbert is consistently ranked as the best place to live in Arizona and was named the most prosperous city in America by the public policy organization, Economic Innovation Group. www.GilbertEDI.comThe Gilbert, Arizona Office of Economic Development is committed to attracting, growing, and retaining business and industry to the Town of Gilbert. The Office p nd more than 200 private investors to accomplish its mission and serve as a strategic partner to companies across the world as they expand or relocate to Greater Phoenix. Over the past 34 years, GPEC has fueled the regional economy by helping over 980 companies, creating nearly 182,000 jobs and more than $65 billion in capital investment. Greater Phoenix is in a relentless pursuit of innovative and entrepreneurial-focused companies looking to thrive and scale in a vibrant, dynamic region. There is an undeniable spirit about Greater Phoenix; one rooted in strength, collaboration and resilience. Greater Phoenix is Greater Together. For more information about GPEC and how we can assist your businesses, visit www.gpec.org.The Greater Phoenix Economic Council (GPEC), globally recognized as a top economic development organization (EDO), works to attract and grow quality businesses and advocate for the competitiveness of Greater Phoenix. A data-driven regional EDO, GPEC works with 22 member communities, Maricopa and Pinal counties, a",
  "url": "https://www.gilbertedi.com/expertec-acquires-work-truck-solutions-announces-first-us-expansion-in-gilbert-ariz/",
  "date": "2024-06-10"
}