{
  "title": "Governor Glenn Youngkin Announces Perdue AgriBusiness to Invest $59.1 Million to Expand in the City of Chesapeake",
  "content": "Leading agriculture products company to increase production capacity, modernize soybean extraction facility dustry leaders reinvest in Virginia, it is a strong endorsement of the many attributes that make our Commonwealth a best-in-class business location,” said Governor Youngkin. “Perdue AgriBusiness is a valued employer in Chesapeake and a major contributor to Virginia farmers’ livelihoods, and we look forward to its continued growth trajectory with the modernization and expansion of this facility.”“When in . It has been their tireless work, continual investment in new and more efficient farming equipment, and embrace of technology that has kept the Commonwealth’s agriculture sector growing and secure in its top position as the state’s largest private sector industry,” said Secretary of Agriculture and Forestry Matt Lohr. “I commend Perdue for sharing this same commitment to innovation and investment in new equipment and technologies, because it is the diverse and global markets that facilities like this provide our farmers that drive the whole industry forward.”“Virginia is home to some of the world’s most innovative and productive farmers hain issues, the Port of Virginia had its most productive fiscal year yet, processing more than 3.2 million twenty-foot equivalent units. The Port of Virginia is a best-in-class asset for the Commonwealth.”“Virginia’s transportation infrastructure is essential to getting Perdue AgriBusiness’ soybeans and other high-oil content products where they need to go. The two Class I railroads, our interstate network, inland port, and barge service to Richmond enable cargo to move efficiently through the Port of Virginia,” said Secretary of Transportation Shep Miller. “Last year, while other ports around the country were riddled with supply c es, from our location to our business climate. We look forward to the continued partnership with Perdue and are proud to see their growth in the City of Chesapeake.”“The City of Chesapeake is very excited about the expansion of Perdue AgriBusiness,” said Chesapeake Mayor Rick West. “Perdue’s decision to choose Chesapeake for its expansion just further highlights the many advantages our city has to offer business able contributor to our state and local economy. I’m especially grateful that this investment will enhance the South Norfolk Tax Increment Financing District.”“I am thankful to have had the opportunity to tour Perdue AgriBusiness last year and could not be happier to hear about their increased investment in the 77th House District,” said Delegate C. E. Cliff Hayes, Jr. “Perdue AgriBusiness is a valu in the U.S., Perdue AgriBusiness is a leading merchandiser, processor, and exporter of agricultural products. Through Perdue AgriBusiness’ 75 elevator locations with more than 75 million bushels of storage, deep-water port, transload facilities, oilseed crushing operations, edible oil refinery, and protein blend mills, the company serves markets across the United States and around the world. Perdue Farms employs more than 2,800 associates across Virginia.Perdue AgriBusiness is an independent operating company of Perdue Farms Inc. Ranked among the largest grain companies ible to apply for the Railroad Industrial Access Program through the Virginia Department of Rail and Public Transportation, subject to approval by the Commonwealth Transportation Board.The Virginia Economic Development Partnership and the Virginia Department of Agriculture and Consumer Services worked with the City of Chesapeake to secure the project for Virginia. The Governor approved a performance-based grant of $500,000 from the Virginia Investment Performance Grant, an incentive that encourages continued capital investment by existing Virginia companies, as well as a $450,000 grant from the Governor’s Agriculture and Forestry Industries Development Fund to assist the City of Chesapeake with the project. The company is also elig",
  "url": "https://chesapeakeva.biz/perdue-agribusiness/",
  "date": "2022-03-22"
}