{
  "title": "Denver Invests in Future with NWSL Deal, Park Hill Acquisition",
  "content": "The City and County of Denver today announced the approval of two catalytic investments negotiated by Mayor Mike Johnston to galvanize Denver’s economy, create jobs, and restore community. ht never come.” “With our country facing such economic uncertainty, now is the time to grab the reins and seize the opportunity to invest in our future,” said Mayor Mike Johnston. “There is nothing Denver cannot do when we work together - whether that’s building the Denver of tomorrow, demonstrating that women’s sports are as valuable as men’s, or giving Park Hill back to the people who fought so long and so hard for a day they thought mig esidents who have made the neighborhood home for generations.” said Councilwoman Shontel M. Lewis. “As we move forward, my office will ensure that community voices are at the heart of the visioning process — so that Park Hill can grow and thrive without leaving anyone behind.” “This is more than a land deal — It is recognition that the city must invest not only in creating an incredible park, but also in the r stadium. Funding for the site will come from Denver’s capital improvement fund – used specifically for economic development projects – and will not affect the city’s general operating budget. On Monday, City Council also approved in an 11-1 vote an intergovernmental agreement between the City and County of Denver and the Broadway Station Metropolitan District to spend up to $70 million on land acquisition and infrastructure improvements to enable one of the world’s only purpose-built professional women’s soccer stadiums at Santa Fe Yards, which will be the home stadium for the new Denver NWSL team. The site, which has sat dormant for over 20 years, will return to the city if it ceases to be used as a e stadium itself will be built and funded by the NWSL team ownership group and will open in March 2028. An economic impact study from Denver’s Department of Finance estimated the site investment could generate up to $2.2 billion in economic impact and nearly $500 million in tax revenue over 30 years as well as directly and indirectly create more than 1,100 jobs. Th",
  "url": "https://www.denvergov.org/Government/Agencies-Departments-Offices/Agencies-Departments-Offices-Directory/Mayors-Office/News/2025/Denver-Makes-Generational-Investment-in-City%E2%80%99s-Future-with-Passage-of-NWSL-Agreement-Park-Hill-Acquisition",
  "date": "2025-05-12"
}