{
  "title": "Kraft Heinz Embarks on a New $143 Million Expansion Project in Garland",
  "content": "Kraft Heinz Food Company and the City of Garland have partnered on a $143 million expansion project to modernize and upgrade manufacturing capacity. Operating from their facility off Forest Lane since 1949, Kraft Heinz Food Company will make a major new capital investment in Garland, with plans to add new lines of production while also modernizing existing lines. imately 1,500 employees across two facilities, Kraft Heinz is already a major employer; however, they intend to add to this by hiring approximately 200 new positions to accommodate the increases in production, bringing payroll over $100 million including benefits.The planned investment will include significant facility renovations for employee wellness and purchases of additional machinery and equipment to add two to three new lines of production as well as modernize existing lines. At approx The approved expansion will also significantly grow the City’s target industry of food and beverage production. Kraft Heinz’s Garland operation is one of the company’s largest manufacturers of Lunchables, Kraft barbecue sauce and vinegar, with plant distribution reaching across the country. They lead the pack of several other major food manufacturers in Garland, including Daisy Brand, Bake Mex, US Foods and First Place Foods. adaptive reuse and infill projects are continuing to play a major role in future development of Garland.Garland’s industrial district has seen a number of redevelopment and expansion projects in the past several years. These projects have ranged in size from the redevelopment of the prior Raytheon campus into over 760,000 square feet of new flex industrial buildings, to smaller infill projects such as Marquis Logistics, which brought over 200,000 square feet of new industrial space in 2023. Additional redevelopment,",
  "url": "https://garlandedp.com/kraft-heinz-embarks-on-a-new-143-million-expansion-project-in-garland/",
  "date": "2024-07-12"
}