{
  "title": "Michigan Strategic Fund Board approves amendments to support manufacturing jobs and startup innovation",
  "content": "opment strategy of supporting People, Places and Projects,” said Quentin L. Messer, Jr., CEO of the Michigan Economic Development Corporation and Chair of the MSF Board. “I’m grateful to Governor Whitmer, our bipartisan partners in the state legislature, and the volunteer MSF Board for their ongoing support and collaboration to deliver solutions and results for businesses and residents in our great state. Work remains, but today’s approvals reflect Team Michigan’s ongoing commitment to innovation and growth within our key industries.”“Whether supporting Michigan’s startup ecosystem, capitalizing on federal support for small businesses in our automotive manufacturing sector or ensuring the continued success of a key battery plant project in Lansing, today’s approved actions and projects by the MSF Board help Team Michigan deliver on the state’s ‘Make It in Michigan’ economic devel ge competitive edge technologies that require capital in the earliest stages of the commercialization process.The Board also approved a series of Michigan Innovate Capital Fund (MICF) program updates and amendments to help the MEDC continue to provide essential support to high-tech startups in the state. In June 2023, the MSF approved the MICF program, which provides award incentives to nonprofit organizations that operate fund programs to invest in pre-seed and startup sta ng in America Small Business Opportunity Program (SBOP) awarded the MEDC $9,092,364 to support the Michigan Auto Supplier Transition Program The State Small Business Credit Initiative (SSBCI) Investi ttery plant and 100% transfer of state incentives already secured for the facility, LGES will wholly own the facility – ensuring the project stays on track and high-tech jobs and battery manufacturing remain in Michigan.The Board approved amendments to the MSF incentives authorized in January 2022 for the construction of an Ultium battery manufacturing facility in Lansing, originally a joint venture between GM and LG Energy Solution (LGES). Through the sale of GM’s portion of the ba s in the community Building on the significant employment of Michigan’s construction and trade workforce over the past 18 months throughout its construction, LGES maintains a commitment to creating at least 1,360 good-paying, permanent job \"This transition strengthens the Lansing region’s position as a leader in battery manufacturing, bringing increased investment, sustained jobs creation and a more diversified battery manufacturing ecosystem. LG Energy Solution is a global leader in developing and producing high-voltage batteries and related technology for electric vehicles, energy storage systems and mobility and IT applications,” said Bob Trezise, president and CEO of LEAP.",
  "url": "https://www.michiganbusiness.org/press-releases/2025/03/msf/",
  "date": "2025-03-25"
}