{
  "title": "DEGC helps secure BAMF Health’s new precision medicine center at Bedrock’s Gratiot Site, creating 90 jobs and $93.7 million investment",
  "content": "DETROIT (April 22, 2025) - The Michigan Strategic Fund (MSF) Board today approved support for BAMF Health’s new theranostics center and radiopharmacy in downtown Detroit. The project is expected to create up to 90 jobs and generate an estimated $93.7 million in capital investment in the City of Detroit. ers,” said Kevin Johnson, president and CEO of the Detroit Economic Growth Corporation. “The DEGC proudly supported BAMF during our 2.5-year attraction effort alongside the MEDC. We are grateful to the MSF Board for their support of this transformative development.”“The arrival of BAMF Health’s innovative Theranostics Center in downtown Detroit is akin to planting a seed in already fertile ground. This project will grow the city’s burgeoning medical ecosystem and bring next-generation cancer therapies to Detroit e kind of high-impact medical innovation Detroit is attracting,” said David White, vice president of Business Development at the DEGC. “After working closely with BAMF Health for over two years, we’re thrilled to see them choose Detroit for their expansion. This facility will create quality jobs and provide advanced cancer treatments for patients throughout Michigan and beyond.”“This project represents th very beginning, we were determined to deliver BAMF’s advanced, life-saving technology to the people of Detroit and southeast Michigan, and soon that vision will come to life,” said BAMF Health Founder and CEO Anthony Chang, PhD, in a press release last year.“From the DEGC also manages important initiatives to support small businesses and grow neighborhood commercial corridors. DEGC is dedicated to inclusive development and access to economic opportunity.Detroit Economic Growth Corporation is a non-profit organization that serves as Detroit’s lead implementing agency for business retention, attraction and economic development. DEGC is led by a board comprised of business, civic and community leaders. Its staff provides services for key public authorities that facilitate incentives and other forms of financing for projects that bring new jobs and investment to the Ciy. DEGC also manages important initiatives to support small businesses and grow neighborhood commercial corridors. DEGC is dedicated to inclusive development and access to economic opportunity.",
  "url": "https://www.degc.org/post/degc-helps-secure-bamf-health-s-new-precision-medicine-center-at-bedrock-s-gratiot-site-creating-90",
  "date": "2025-04-22"
}